
build/cli_main.elf:     file format elf32-msp430

Contents of the .debug_aranges section:

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    0000c00c 00000004 
    0000c03c 0000003c 
    0000c28a 00000004 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xae
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    0000c12a 00000022 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0x6a2
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    0000c010 0000000e 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0x754
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    0000c01e 00000014 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0x806
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    0000c032 0000000a 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0x8b8
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    0000c210 00000038 
    00000000 00000000 

 <0><811>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <812>   DW_AT_stmt_list   : 0x276
    <816>   DW_AT_low_pc      : 0xc032
    <81a>   DW_AT_high_pc     : 0xc03c
    <81e>   DW_AT_name        : ../../../../../../gcc/libgloss/msp430/crt0.S
    <84b>   DW_AT_comp_dir    : /home/nhivp/Downloads/msp430-gcc-7.3.1.24-source-full/build/gcc/msp430-elf/430/libgloss/msp430
    <8aa>   DW_AT_producer    : GNU AS 2.26
    <8b6>   DW_AT_language    : 32769	(MIPS assembler)
  Compilation Unit @ offset 0x8b8:
   Length:        0x8f6 (32-bit)
   Version:       4
   Abbrev Offset: 0xe2
   Pointer Size:  4
 <0><8c3>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <8c4>   DW_AT_producer    : (indirect string, offset: 0x7fc): GNU C11 7.3.1 -mcpu=msp430 -mhwmult=none -mOs -mcpu=msp430 -g -g -Os -O2 -Os -fno-builtin -ffunction-sections -fdata-sections
    <8c8>   DW_AT_language    : 12	(ANSI C99)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x8e1): ../../../../../../../gcc/newlib/libc/string/memmove.c
    <8cd>   DW_AT_comp_dir    : (indirect string, offset: 0x540): /home/nhivp/Downloads/msp430-gcc-7.3.1.24-source-full/build/gcc/msp430-elf/430/newlib/libc/string
    <8d1>   DW_AT_ranges      : 0x28
    <8d5>   DW_AT_low_pc      : 0x0
    <8d9>   DW_AT_stmt_list   : 0x2e0
 <1><8dd>: Abbrev Number: 2 (DW_TAG_base_type)
    <8de>   DW_AT_byte_size   : 2
    <8df>   DW_AT_encoding    : 5	(signed)
    <8e0>   DW_AT_name        : int
 <1><8e4>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x4e1): size_t
    <8e9>   DW_AT_decl_file   : 2
    <8ea>   DW_AT_decl_line   : 216
    <8eb>   DW_AT_type        : <0x8ef>
 <1><8ef>: Abbrev Number: 4 (DW_TAG_base_type)
    <8f0>   DW_AT_byte_size   : 2
    <8f1>   DW_AT_encoding    : 7	(unsigned)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x2cd): unsigned int
 <1><8f6>: Abbrev Number: 4 (DW_TAG_base_type)
    <8f7>   DW_AT_byte_size   : 4
    <8f8>   DW_AT_encoding    : 5	(signed)
    <8f9>   DW_AT_name        : (indirect string, offset: 0x200): long int
 <1><8fd>: Abbrev Number: 4 (DW_TAG_base_type)
    <8fe>   DW_AT_byte_size   : 8
    <8ff>   DW_AT_encoding    : 5	(signed)
    <900>   DW_AT_name        : (indirect string, offset: 0x1fb): long long int
 <1><904>: Abbrev Number: 4 (DW_TAG_base_type)
    <905>   DW_AT_byte_size   : 8
    <906>   DW_AT_encoding    : 4	(float)
    <907>   DW_AT_name        : (indirect string, offset: 0x6fe): long double
 <1><90b>: Abbrev Number: 4 (DW_TAG_base_type)
    <90c>   DW_AT_byte_size   : 1
    <90d>   DW_AT_encoding    : 6	(signed char)
    <90e>   DW_AT_name        : (indirect string, offset: 0x28c): signed char
 <1><912>: Abbrev Number: 4 (DW_TAG_base_type)
    <913>   DW_AT_byte_size   : 1
    <914>   DW_AT_encoding    : 8	(unsigned char)
    <915>   DW_AT_name        : (indirect string, offset: 0x28a): unsigned char
 <1><919>: Abbrev Number: 4 (DW_TAG_base_type)
    <91a>   DW_AT_byte_size   : 2
    <91b>   DW_AT_encoding    : 5	(signed)
    <91c>   DW_AT_name        : (indirect string, offset: 0x4e): short int
 <1><920>: Abbrev Number: 4 (DW_TAG_base_type)
    <921>   DW_AT_byte_size   : 2
    <922>   DW_AT_encoding    : 7	(unsigned)
    <923>   DW_AT_name        : (indirect string, offset: 0x31d): short unsigned int
 <1><927>: Abbrev Number: 4 (DW_TAG_base_type)
    <928>   DW_AT_byte_size   : 4
    <929>   DW_AT_encoding    : 7	(unsigned)
    <92a>   DW_AT_name        : (indirect string, offset: 0x2c8): long unsigned int
 <1><92e>: Abbrev Number: 4 (DW_TAG_base_type)
    <92f>   DW_AT_byte_size   : 8
    <930>   DW_AT_encoding    : 7	(unsigned)
    <931>   DW_AT_name        : (indirect string, offset: 0x2c3): long long unsigned int
 <1><935>: Abbrev Number: 3 (DW_TAG_typedef)
    <936>   DW_AT_name        : (indirect string, offset: 0x5ef): _LOCK_RECURSIVE_T
    <93a>   DW_AT_decl_file   : 3
    <93b>   DW_AT_decl_line   : 7
    <93c>   DW_AT_type        : <0x8dd>
 <1><940>: Abbrev Number: 3 (DW_TAG_typedef)
    <941>   DW_AT_name        : (indirect string, offset: 0x4bc): _off_t
    <945>   DW_AT_decl_file   : 4
    <946>   DW_AT_decl_line   : 16
    <947>   DW_AT_type        : <0x8f6>
 <1><94b>: Abbrev Number: 3 (DW_TAG_typedef)
    <94c>   DW_AT_name        : (indirect string, offset: 0x6cd): _fpos_t
    <950>   DW_AT_decl_file   : 4
    <951>   DW_AT_decl_line   : 39
    <952>   DW_AT_type        : <0x8f6>
 <1><956>: Abbrev Number: 5 (DW_TAG_typedef)
    <957>   DW_AT_name        : (indirect string, offset: 0x7ac): wint_t
    <95b>   DW_AT_decl_file   : 2
    <95c>   DW_AT_decl_line   : 357
    <95e>   DW_AT_type        : <0x8ef>
 <1><962>: Abbrev Number: 6 (DW_TAG_union_type)
    <963>   DW_AT_byte_size   : 4
    <964>   DW_AT_decl_file   : 4
    <965>   DW_AT_decl_line   : 74
    <966>   DW_AT_sibling     : <0x981>
 <2><96a>: Abbrev Number: 7 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0x4c3): __wch
    <96f>   DW_AT_decl_file   : 4
    <970>   DW_AT_decl_line   : 76
    <971>   DW_AT_type        : <0x956>
 <2><975>: Abbrev Number: 7 (DW_TAG_member)
    <976>   DW_AT_name        : (indirect string, offset: 0x722): __wchb
    <97a>   DW_AT_decl_file   : 4
    <97b>   DW_AT_decl_line   : 77
    <97c>   DW_AT_type        : <0x981>
 <2><980>: Abbrev Number: 0
 <1><981>: Abbrev Number: 8 (DW_TAG_array_type)
    <982>   DW_AT_type        : <0x912>
    <986>   DW_AT_sibling     : <0x991>
 <2><98a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <98b>   DW_AT_type        : <0x8ef>
    <98f>   DW_AT_upper_bound : 3
 <2><990>: Abbrev Number: 0
 <1><991>: Abbrev Number: 10 (DW_TAG_structure_type)
    <992>   DW_AT_byte_size   : 6
    <993>   DW_AT_decl_file   : 4
    <994>   DW_AT_decl_line   : 71
    <995>   DW_AT_sibling     : <0x9b2>
 <2><999>: Abbrev Number: 11 (DW_TAG_member)
    <99a>   DW_AT_name        : (indirect string, offset: 0x5ab): __count
    <99e>   DW_AT_decl_file   : 4
    <99f>   DW_AT_decl_line   : 73
    <9a0>   DW_AT_type        : <0x8dd>
    <9a4>   DW_AT_data_member_location: 0
 <2><9a5>: Abbrev Number: 11 (DW_TAG_member)
    <9a6>   DW_AT_name        : (indirect string, offset: 0x4d2): __value
    <9aa>   DW_AT_decl_file   : 4
    <9ab>   DW_AT_decl_line   : 78
    <9ac>   DW_AT_type        : <0x962>
    <9b0>   DW_AT_data_member_location: 2
 <2><9b1>: Abbrev Number: 0
 <1><9b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x7e9): _mbstate_t
    <9b7>   DW_AT_decl_file   : 4
    <9b8>   DW_AT_decl_line   : 79
    <9b9>   DW_AT_type        : <0x991>
 <1><9bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <9be>   DW_AT_name        : (indirect string, offset: 0x6dc): _flock_t
    <9c2>   DW_AT_decl_file   : 4
    <9c3>   DW_AT_decl_line   : 83
    <9c4>   DW_AT_type        : <0x935>
 <1><9c8>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <9c9>   DW_AT_byte_size   : 2
 <1><9ca>: Abbrev Number: 3 (DW_TAG_typedef)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x8b1): __ULong
    <9cf>   DW_AT_decl_file   : 5
    <9d0>   DW_AT_decl_line   : 22
    <9d1>   DW_AT_type        : <0x927>
 <1><9d5>: Abbrev Number: 13 (DW_TAG_structure_type)
    <9d6>   DW_AT_name        : (indirect string, offset: 0x7f4): _Bigint
    <9da>   DW_AT_byte_size   : 14
    <9db>   DW_AT_decl_file   : 5
    <9dc>   DW_AT_decl_line   : 45
    <9dd>   DW_AT_sibling     : <0xa28>
 <2><9e1>: Abbrev Number: 11 (DW_TAG_member)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x7e3): _next
    <9e6>   DW_AT_decl_file   : 5
    <9e7>   DW_AT_decl_line   : 47
    <9e8>   DW_AT_type        : <0xa28>
    <9ec>   DW_AT_data_member_location: 0
 <2><9ed>: Abbrev Number: 14 (DW_TAG_member)
    <9ee>   DW_AT_name        : _k
    <9f1>   DW_AT_decl_file   : 5
    <9f2>   DW_AT_decl_line   : 48
    <9f3>   DW_AT_type        : <0x8dd>
    <9f7>   DW_AT_data_member_location: 2
 <2><9f8>: Abbrev Number: 11 (DW_TAG_member)
    <9f9>   DW_AT_name        : (indirect string, offset: 0x87a): _maxwds
    <9fd>   DW_AT_decl_file   : 5
    <9fe>   DW_AT_decl_line   : 48
    <9ff>   DW_AT_type        : <0x8dd>
    <a03>   DW_AT_data_member_location: 4
 <2><a04>: Abbrev Number: 11 (DW_TAG_member)
    <a05>   DW_AT_name        : (indirect string, offset: 0x95a): _sign
    <a09>   DW_AT_decl_file   : 5
    <a0a>   DW_AT_decl_line   : 48
    <a0b>   DW_AT_type        : <0x8dd>
    <a0f>   DW_AT_data_member_location: 6
 <2><a10>: Abbrev Number: 11 (DW_TAG_member)
    <a11>   DW_AT_name        : (indirect string, offset: 0x78d): _wds
    <a15>   DW_AT_decl_file   : 5
    <a16>   DW_AT_decl_line   : 48
    <a17>   DW_AT_type        : <0x8dd>
    <a1b>   DW_AT_data_member_location: 8
 <2><a1c>: Abbrev Number: 14 (DW_TAG_member)
    <a1d>   DW_AT_name        : _x
    <a20>   DW_AT_decl_file   : 5
    <a21>   DW_AT_decl_line   : 49
    <a22>   DW_AT_type        : <0xa2e>
    <a26>   DW_AT_data_member_location: 10
 <2><a27>: Abbrev Number: 0
 <1><a28>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <a29>   DW_AT_byte_size   : 2
    <a2a>   DW_AT_type        : <0x9d5>
 <1><a2e>: Abbrev Number: 8 (DW_TAG_array_type)
    <a2f>   DW_AT_type        : <0x9ca>
    <a33>   DW_AT_sibling     : <0xa3e>
 <2><a37>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <a38>   DW_AT_type        : <0x8ef>
    <a3c>   DW_AT_upper_bound : 0
 <2><a3d>: Abbrev Number: 0
 <1><a3e>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a3f>   DW_AT_name        : (indirect string, offset: 0x799): __tm
    <a43>   DW_AT_byte_size   : 18
    <a44>   DW_AT_decl_file   : 5
    <a45>   DW_AT_decl_line   : 53
    <a46>   DW_AT_sibling     : <0xab7>
 <2><a4a>: Abbrev Number: 11 (DW_TAG_member)
    <a4b>   DW_AT_name        : (indirect string, offset: 0x601): __tm_sec
    <a4f>   DW_AT_decl_file   : 5
    <a50>   DW_AT_decl_line   : 55
    <a51>   DW_AT_type        : <0x8dd>
    <a55>   DW_AT_data_member_location: 0
 <2><a56>: Abbrev Number: 11 (DW_TAG_member)
    <a57>   DW_AT_name        : (indirect string, offset: 0x625): __tm_min
    <a5b>   DW_AT_decl_file   : 5
    <a5c>   DW_AT_decl_line   : 56
    <a5d>   DW_AT_type        : <0x8dd>
    <a61>   DW_AT_data_member_location: 2
 <2><a62>: Abbrev Number: 11 (DW_TAG_member)
    <a63>   DW_AT_name        : (indirect string, offset: 0x70a): __tm_hour
    <a67>   DW_AT_decl_file   : 5
    <a68>   DW_AT_decl_line   : 57
    <a69>   DW_AT_type        : <0x8dd>
    <a6d>   DW_AT_data_member_location: 4
 <2><a6e>: Abbrev Number: 11 (DW_TAG_member)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x5b3): __tm_mday
    <a73>   DW_AT_decl_file   : 5
    <a74>   DW_AT_decl_line   : 58
    <a75>   DW_AT_type        : <0x8dd>
    <a79>   DW_AT_data_member_location: 6
 <2><a7a>: Abbrev Number: 11 (DW_TAG_member)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x8d8): __tm_mon
    <a7f>   DW_AT_decl_file   : 5
    <a80>   DW_AT_decl_line   : 59
    <a81>   DW_AT_type        : <0x8dd>
    <a85>   DW_AT_data_member_location: 8
 <2><a86>: Abbrev Number: 11 (DW_TAG_member)
    <a87>   DW_AT_name        : (indirect string, offset: 0x882): __tm_year
    <a8b>   DW_AT_decl_file   : 5
    <a8c>   DW_AT_decl_line   : 60
    <a8d>   DW_AT_type        : <0x8dd>
    <a91>   DW_AT_data_member_location: 10
 <2><a92>: Abbrev Number: 11 (DW_TAG_member)
    <a93>   DW_AT_name        : (indirect string, offset: 0x669): __tm_wday
    <a97>   DW_AT_decl_file   : 5
    <a98>   DW_AT_decl_line   : 61
    <a99>   DW_AT_type        : <0x8dd>
    <a9d>   DW_AT_data_member_location: 12
 <2><a9e>: Abbrev Number: 11 (DW_TAG_member)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x8a7): __tm_yday
    <aa3>   DW_AT_decl_file   : 5
    <aa4>   DW_AT_decl_line   : 62
    <aa5>   DW_AT_type        : <0x8dd>
    <aa9>   DW_AT_data_member_location: 14
 <2><aaa>: Abbrev Number: 11 (DW_TAG_member)
    <aab>   DW_AT_name        : (indirect string, offset: 0x694): __tm_isdst
    <aaf>   DW_AT_decl_file   : 5
    <ab0>   DW_AT_decl_line   : 63
    <ab1>   DW_AT_type        : <0x8dd>
    <ab5>   DW_AT_data_member_location: 16
 <2><ab6>: Abbrev Number: 0
 <1><ab7>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x736): _on_exit_args
    <abc>   DW_AT_byte_size   : 136
    <abd>   DW_AT_decl_file   : 5
    <abe>   DW_AT_decl_line   : 72
    <abf>   DW_AT_sibling     : <0xaf4>
 <2><ac3>: Abbrev Number: 11 (DW_TAG_member)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x673): _fnargs
    <ac8>   DW_AT_decl_file   : 5
    <ac9>   DW_AT_decl_line   : 73
    <aca>   DW_AT_type        : <0xaf4>
    <ace>   DW_AT_data_member_location: 0
 <2><acf>: Abbrev Number: 11 (DW_TAG_member)
    <ad0>   DW_AT_name        : (indirect string, offset: 0x949): _dso_handle
    <ad4>   DW_AT_decl_file   : 5
    <ad5>   DW_AT_decl_line   : 74
    <ad6>   DW_AT_type        : <0xaf4>
    <ada>   DW_AT_data_member_location: 64
 <2><adb>: Abbrev Number: 11 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0x6c4): _fntypes
    <ae0>   DW_AT_decl_file   : 5
    <ae1>   DW_AT_decl_line   : 76
    <ae2>   DW_AT_type        : <0x9ca>
    <ae6>   DW_AT_data_member_location: 128
 <2><ae7>: Abbrev Number: 11 (DW_TAG_member)
    <ae8>   DW_AT_name        : (indirect string, offset: 0x7cc): _is_cxa
    <aec>   DW_AT_decl_file   : 5
    <aed>   DW_AT_decl_line   : 79
    <aee>   DW_AT_type        : <0x9ca>
    <af2>   DW_AT_data_member_location: 132
 <2><af3>: Abbrev Number: 0
 <1><af4>: Abbrev Number: 8 (DW_TAG_array_type)
    <af5>   DW_AT_type        : <0x9c8>
    <af9>   DW_AT_sibling     : <0xb04>
 <2><afd>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <afe>   DW_AT_type        : <0x8ef>
    <b02>   DW_AT_upper_bound : 31
 <2><b03>: Abbrev Number: 0
 <1><b04>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b05>   DW_AT_name        : (indirect string, offset: 0x5d9): _atexit
    <b09>   DW_AT_byte_size   : 70
    <b0a>   DW_AT_decl_file   : 5
    <b0b>   DW_AT_decl_line   : 83
    <b0c>   DW_AT_sibling     : <0xb41>
 <2><b10>: Abbrev Number: 11 (DW_TAG_member)
    <b11>   DW_AT_name        : (indirect string, offset: 0x7e3): _next
    <b15>   DW_AT_decl_file   : 5
    <b16>   DW_AT_decl_line   : 84
    <b17>   DW_AT_type        : <0xb41>
    <b1b>   DW_AT_data_member_location: 0
 <2><b1c>: Abbrev Number: 11 (DW_TAG_member)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x92d): _ind
    <b21>   DW_AT_decl_file   : 5
    <b22>   DW_AT_decl_line   : 85
    <b23>   DW_AT_type        : <0x8dd>
    <b27>   DW_AT_data_member_location: 2
 <2><b28>: Abbrev Number: 11 (DW_TAG_member)
    <b29>   DW_AT_name        : (indirect string, offset: 0x649): _fns
    <b2d>   DW_AT_decl_file   : 5
    <b2e>   DW_AT_decl_line   : 86
    <b2f>   DW_AT_type        : <0xb47>
    <b33>   DW_AT_data_member_location: 4
 <2><b34>: Abbrev Number: 11 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0x64e): _on_exit_args_ptr
    <b39>   DW_AT_decl_file   : 5
    <b3a>   DW_AT_decl_line   : 87
    <b3b>   DW_AT_type        : <0xb5e>
    <b3f>   DW_AT_data_member_location: 68
 <2><b40>: Abbrev Number: 0
 <1><b41>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <b42>   DW_AT_byte_size   : 2
    <b43>   DW_AT_type        : <0xb04>
 <1><b47>: Abbrev Number: 8 (DW_TAG_array_type)
    <b48>   DW_AT_type        : <0xb57>
    <b4c>   DW_AT_sibling     : <0xb57>
 <2><b50>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <b51>   DW_AT_type        : <0x8ef>
    <b55>   DW_AT_upper_bound : 31
 <2><b56>: Abbrev Number: 0
 <1><b57>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <b58>   DW_AT_byte_size   : 2
    <b59>   DW_AT_type        : <0xb5d>
 <1><b5d>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <b5e>   DW_AT_prototyped  : 1
 <1><b5e>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <b5f>   DW_AT_byte_size   : 2
    <b60>   DW_AT_type        : <0xab7>
 <1><b64>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b65>   DW_AT_name        : (indirect string, offset: 0x4da): __sbuf
    <b69>   DW_AT_byte_size   : 4
    <b6a>   DW_AT_decl_file   : 5
    <b6b>   DW_AT_decl_line   : 115
    <b6c>   DW_AT_sibling     : <0xb89>
 <2><b70>: Abbrev Number: 11 (DW_TAG_member)
    <b71>   DW_AT_name        : (indirect string, offset: 0x76c): _base
    <b75>   DW_AT_decl_file   : 5
    <b76>   DW_AT_decl_line   : 116
    <b77>   DW_AT_type        : <0xb89>
    <b7b>   DW_AT_data_member_location: 0
 <2><b7c>: Abbrev Number: 11 (DW_TAG_member)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x9a8): _size
    <b81>   DW_AT_decl_file   : 5
    <b82>   DW_AT_decl_line   : 117
    <b83>   DW_AT_type        : <0x8dd>
    <b87>   DW_AT_data_member_location: 2
 <2><b88>: Abbrev Number: 0
 <1><b89>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <b8a>   DW_AT_byte_size   : 2
    <b8b>   DW_AT_type        : <0x912>
 <1><b8f>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b90>   DW_AT_name        : (indirect string, offset: 0x920): __sFILE_fake
    <b94>   DW_AT_byte_size   : 18
    <b95>   DW_AT_decl_file   : 5
    <b96>   DW_AT_decl_line   : 151
    <b97>   DW_AT_sibling     : <0xbf9>
 <2><b9b>: Abbrev Number: 14 (DW_TAG_member)
    <b9c>   DW_AT_name        : _p
    <b9f>   DW_AT_decl_file   : 5
    <ba0>   DW_AT_decl_line   : 152
    <ba1>   DW_AT_type        : <0xb89>
    <ba5>   DW_AT_data_member_location: 0
 <2><ba6>: Abbrev Number: 14 (DW_TAG_member)
    <ba7>   DW_AT_name        : _r
    <baa>   DW_AT_decl_file   : 5
    <bab>   DW_AT_decl_line   : 153
    <bac>   DW_AT_type        : <0x8dd>
    <bb0>   DW_AT_data_member_location: 2
 <2><bb1>: Abbrev Number: 14 (DW_TAG_member)
    <bb2>   DW_AT_name        : _w
    <bb5>   DW_AT_decl_file   : 5
    <bb6>   DW_AT_decl_line   : 154
    <bb7>   DW_AT_type        : <0x8dd>
    <bbb>   DW_AT_data_member_location: 4
 <2><bbc>: Abbrev Number: 11 (DW_TAG_member)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x532): _flags
    <bc1>   DW_AT_decl_file   : 5
    <bc2>   DW_AT_decl_line   : 155
    <bc3>   DW_AT_type        : <0x919>
    <bc7>   DW_AT_data_member_location: 6
 <2><bc8>: Abbrev Number: 11 (DW_TAG_member)
    <bc9>   DW_AT_name        : (indirect string, offset: 0x772): _file
    <bcd>   DW_AT_decl_file   : 5
    <bce>   DW_AT_decl_line   : 156
    <bcf>   DW_AT_type        : <0x919>
    <bd3>   DW_AT_data_member_location: 8
 <2><bd4>: Abbrev Number: 14 (DW_TAG_member)
    <bd5>   DW_AT_name        : _bf
    <bd9>   DW_AT_decl_file   : 5
    <bda>   DW_AT_decl_line   : 157
    <bdb>   DW_AT_type        : <0xb64>
    <bdf>   DW_AT_data_member_location: 10
 <2><be0>: Abbrev Number: 11 (DW_TAG_member)
    <be1>   DW_AT_name        : (indirect string, offset: 0x4c9): _lbfsize
    <be5>   DW_AT_decl_file   : 5
    <be6>   DW_AT_decl_line   : 158
    <be7>   DW_AT_type        : <0x8dd>
    <beb>   DW_AT_data_member_location: 14
 <2><bec>: Abbrev Number: 11 (DW_TAG_member)
    <bed>   DW_AT_name        : (indirect string, offset: 0x6be): _data
    <bf1>   DW_AT_decl_file   : 5
    <bf2>   DW_AT_decl_line   : 160
    <bf3>   DW_AT_type        : <0xd44>
    <bf7>   DW_AT_data_member_location: 16
 <2><bf8>: Abbrev Number: 0
 <1><bf9>: Abbrev Number: 17 (DW_TAG_const_type)
    <bfa>   DW_AT_type        : <0xb8f>
 <1><bfe>: Abbrev Number: 18 (DW_TAG_structure_type)
    <bff>   DW_AT_name        : (indirect string, offset: 0x977): _reent
    <c03>   DW_AT_byte_size   : 120
    <c04>   DW_AT_decl_file   : 5
    <c05>   DW_AT_decl_line   : 370
    <c07>   DW_AT_sibling     : <0xd44>
 <2><c0b>: Abbrev Number: 19 (DW_TAG_member)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x611): _errno
    <c10>   DW_AT_decl_file   : 5
    <c11>   DW_AT_decl_line   : 374
    <c13>   DW_AT_type        : <0x8dd>
    <c17>   DW_AT_data_member_location: 0
 <2><c18>: Abbrev Number: 19 (DW_TAG_member)
    <c19>   DW_AT_name        : (indirect string, offset: 0x6a8): _stdin
    <c1d>   DW_AT_decl_file   : 5
    <c1e>   DW_AT_decl_line   : 379
    <c20>   DW_AT_type        : <0xf7e>
    <c24>   DW_AT_data_member_location: 2
 <2><c25>: Abbrev Number: 19 (DW_TAG_member)
    <c26>   DW_AT_name        : (indirect string, offset: 0x8c8): _stdout
    <c2a>   DW_AT_decl_file   : 5
    <c2b>   DW_AT_decl_line   : 379
    <c2d>   DW_AT_type        : <0xf7e>
    <c31>   DW_AT_data_member_location: 4
 <2><c32>: Abbrev Number: 19 (DW_TAG_member)
    <c33>   DW_AT_name        : (indirect string, offset: 0x500): _stderr
    <c37>   DW_AT_decl_file   : 5
    <c38>   DW_AT_decl_line   : 379
    <c3a>   DW_AT_type        : <0xf7e>
    <c3e>   DW_AT_data_member_location: 6
 <2><c3f>: Abbrev Number: 19 (DW_TAG_member)
    <c40>   DW_AT_name        : (indirect string, offset: 0x729): _inc
    <c44>   DW_AT_decl_file   : 5
    <c45>   DW_AT_decl_line   : 381
    <c47>   DW_AT_type        : <0x8dd>
    <c4b>   DW_AT_data_member_location: 8
 <2><c4c>: Abbrev Number: 19 (DW_TAG_member)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x99d): _emergency
    <c51>   DW_AT_decl_file   : 5
    <c52>   DW_AT_decl_line   : 383
    <c54>   DW_AT_type        : <0xe97>
    <c58>   DW_AT_data_member_location: 10
 <2><c59>: Abbrev Number: 19 (DW_TAG_member)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x7c1): __sdidinit
    <c5e>   DW_AT_decl_file   : 5
    <c5f>   DW_AT_decl_line   : 385
    <c61>   DW_AT_type        : <0x8dd>
    <c65>   DW_AT_data_member_location: 12
 <2><c66>: Abbrev Number: 19 (DW_TAG_member)
    <c67>   DW_AT_name        : (indirect string, offset: 0x960): _current_category
    <c6b>   DW_AT_decl_file   : 5
    <c6c>   DW_AT_decl_line   : 387
    <c6e>   DW_AT_type        : <0x8dd>
    <c72>   DW_AT_data_member_location: 14
 <2><c73>: Abbrev Number: 19 (DW_TAG_member)
    <c74>   DW_AT_name        : (indirect string, offset: 0x97e): _current_locale
    <c78>   DW_AT_decl_file   : 5
    <c79>   DW_AT_decl_line   : 388
    <c7b>   DW_AT_type        : <0xecd>
    <c7f>   DW_AT_data_member_location: 16
 <2><c80>: Abbrev Number: 20 (DW_TAG_member)
    <c81>   DW_AT_name        : _mp
    <c85>   DW_AT_decl_file   : 5
    <c86>   DW_AT_decl_line   : 390
    <c88>   DW_AT_type        : <0x10cb>
    <c8c>   DW_AT_data_member_location: 18
 <2><c8d>: Abbrev Number: 19 (DW_TAG_member)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x7d4): __cleanup
    <c92>   DW_AT_decl_file   : 5
    <c93>   DW_AT_decl_line   : 392
    <c95>   DW_AT_type        : <0x10dc>
    <c99>   DW_AT_data_member_location: 20
 <2><c9a>: Abbrev Number: 19 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x778): _gamma_signgam
    <c9f>   DW_AT_decl_file   : 5
    <ca0>   DW_AT_decl_line   : 394
    <ca2>   DW_AT_type        : <0x8dd>
    <ca6>   DW_AT_data_member_location: 22
 <2><ca7>: Abbrev Number: 19 (DW_TAG_member)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x5e1): _cvtlen
    <cac>   DW_AT_decl_file   : 5
    <cad>   DW_AT_decl_line   : 397
    <caf>   DW_AT_type        : <0x8dd>
    <cb3>   DW_AT_data_member_location: 24
 <2><cb4>: Abbrev Number: 19 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x75c): _cvtbuf
    <cb9>   DW_AT_decl_file   : 5
    <cba>   DW_AT_decl_line   : 398
    <cbc>   DW_AT_type        : <0xe97>
    <cc0>   DW_AT_data_member_location: 26
 <2><cc1>: Abbrev Number: 19 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x5d4): _r48
    <cc6>   DW_AT_decl_file   : 5
    <cc7>   DW_AT_decl_line   : 400
    <cc9>   DW_AT_type        : <0x10e2>
    <ccd>   DW_AT_data_member_location: 28
 <2><cce>: Abbrev Number: 19 (DW_TAG_member)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x6af): _localtime_buf
    <cd3>   DW_AT_decl_file   : 5
    <cd4>   DW_AT_decl_line   : 401
    <cd6>   DW_AT_type        : <0x10e8>
    <cda>   DW_AT_data_member_location: 30
 <2><cdb>: Abbrev Number: 19 (DW_TAG_member)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x67b): _asctime_buf
    <ce0>   DW_AT_decl_file   : 5
    <ce1>   DW_AT_decl_line   : 402
    <ce3>   DW_AT_type        : <0xe97>
    <ce7>   DW_AT_data_member_location: 32
 <2><ce8>: Abbrev Number: 19 (DW_TAG_member)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x62e): _sig_func
    <ced>   DW_AT_decl_file   : 5
    <cee>   DW_AT_decl_line   : 405
    <cf0>   DW_AT_type        : <0x10f9>
    <cf4>   DW_AT_data_member_location: 34
 <2><cf5>: Abbrev Number: 19 (DW_TAG_member)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x5d9): _atexit
    <cfa>   DW_AT_decl_file   : 5
    <cfb>   DW_AT_decl_line   : 409
    <cfd>   DW_AT_type        : <0xb41>
    <d01>   DW_AT_data_member_location: 36
 <2><d02>: Abbrev Number: 19 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0x5a2): _atexit0
    <d07>   DW_AT_decl_file   : 5
    <d08>   DW_AT_decl_line   : 410
    <d0a>   DW_AT_type        : <0xb04>
    <d0e>   DW_AT_data_member_location: 38
 <2><d0f>: Abbrev Number: 19 (DW_TAG_member)
    <d10>   DW_AT_name        : (indirect string, offset: 0x72e): __sglue
    <d14>   DW_AT_decl_file   : 5
    <d15>   DW_AT_decl_line   : 413
    <d17>   DW_AT_type        : <0xf43>
    <d1b>   DW_AT_data_member_location: 108
 <2><d1c>: Abbrev Number: 19 (DW_TAG_member)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x510): __sf
    <d21>   DW_AT_decl_file   : 5
    <d22>   DW_AT_decl_line   : 414
    <d24>   DW_AT_type        : <0xf7e>
    <d28>   DW_AT_data_member_location: 114
 <2><d29>: Abbrev Number: 19 (DW_TAG_member)
    <d2a>   DW_AT_name        : (indirect string, offset: 0x5bd): _misc
    <d2e>   DW_AT_decl_file   : 5
    <d2f>   DW_AT_decl_line   : 415
    <d31>   DW_AT_type        : <0x1105>
    <d35>   DW_AT_data_member_location: 116
 <2><d36>: Abbrev Number: 19 (DW_TAG_member)
    <d37>   DW_AT_name        : (indirect string, offset: 0x515): _signal_buf
    <d3b>   DW_AT_decl_file   : 5
    <d3c>   DW_AT_decl_line   : 416
    <d3e>   DW_AT_type        : <0xe97>
    <d42>   DW_AT_data_member_location: 118
 <2><d43>: Abbrev Number: 0
 <1><d44>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <d45>   DW_AT_byte_size   : 2
    <d46>   DW_AT_type        : <0xbfe>
 <1><d4a>: Abbrev Number: 17 (DW_TAG_const_type)
    <d4b>   DW_AT_type        : <0xd44>
 <1><d4f>: Abbrev Number: 13 (DW_TAG_structure_type)
    <d50>   DW_AT_name        : (indirect string, offset: 0x9ae): __sFILE
    <d54>   DW_AT_byte_size   : 60
    <d55>   DW_AT_decl_file   : 5
    <d56>   DW_AT_decl_line   : 179
    <d57>   DW_AT_sibling     : <0xe79>
 <2><d5b>: Abbrev Number: 14 (DW_TAG_member)
    <d5c>   DW_AT_name        : _p
    <d5f>   DW_AT_decl_file   : 5
    <d60>   DW_AT_decl_line   : 180
    <d61>   DW_AT_type        : <0xb89>
    <d65>   DW_AT_data_member_location: 0
 <2><d66>: Abbrev Number: 14 (DW_TAG_member)
    <d67>   DW_AT_name        : _r
    <d6a>   DW_AT_decl_file   : 5
    <d6b>   DW_AT_decl_line   : 181
    <d6c>   DW_AT_type        : <0x8dd>
    <d70>   DW_AT_data_member_location: 2
 <2><d71>: Abbrev Number: 14 (DW_TAG_member)
    <d72>   DW_AT_name        : _w
    <d75>   DW_AT_decl_file   : 5
    <d76>   DW_AT_decl_line   : 182
    <d77>   DW_AT_type        : <0x8dd>
    <d7b>   DW_AT_data_member_location: 4
 <2><d7c>: Abbrev Number: 11 (DW_TAG_member)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x532): _flags
    <d81>   DW_AT_decl_file   : 5
    <d82>   DW_AT_decl_line   : 183
    <d83>   DW_AT_type        : <0x919>
    <d87>   DW_AT_data_member_location: 6
 <2><d88>: Abbrev Number: 11 (DW_TAG_member)
    <d89>   DW_AT_name        : (indirect string, offset: 0x772): _file
    <d8d>   DW_AT_decl_file   : 5
    <d8e>   DW_AT_decl_line   : 184
    <d8f>   DW_AT_type        : <0x919>
    <d93>   DW_AT_data_member_location: 8
 <2><d94>: Abbrev Number: 14 (DW_TAG_member)
    <d95>   DW_AT_name        : _bf
    <d99>   DW_AT_decl_file   : 5
    <d9a>   DW_AT_decl_line   : 185
    <d9b>   DW_AT_type        : <0xb64>
    <d9f>   DW_AT_data_member_location: 10
 <2><da0>: Abbrev Number: 11 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0x4c9): _lbfsize
    <da5>   DW_AT_decl_file   : 5
    <da6>   DW_AT_decl_line   : 186
    <da7>   DW_AT_type        : <0x8dd>
    <dab>   DW_AT_data_member_location: 14
 <2><dac>: Abbrev Number: 11 (DW_TAG_member)
    <dad>   DW_AT_name        : (indirect string, offset: 0x6be): _data
    <db1>   DW_AT_decl_file   : 5
    <db2>   DW_AT_decl_line   : 189
    <db3>   DW_AT_type        : <0xd44>
    <db7>   DW_AT_data_member_location: 16
 <2><db8>: Abbrev Number: 11 (DW_TAG_member)
    <db9>   DW_AT_name        : (indirect string, offset: 0x764): _cookie
    <dbd>   DW_AT_decl_file   : 5
    <dbe>   DW_AT_decl_line   : 193
    <dbf>   DW_AT_type        : <0x9c8>
    <dc3>   DW_AT_data_member_location: 18
 <2><dc4>: Abbrev Number: 11 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x71c): _read
    <dc9>   DW_AT_decl_file   : 5
    <dca>   DW_AT_decl_line   : 195
    <dcb>   DW_AT_type        : <0xea9>
    <dcf>   DW_AT_data_member_location: 20
 <2><dd0>: Abbrev Number: 11 (DW_TAG_member)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x539): _write
    <dd5>   DW_AT_decl_file   : 5
    <dd6>   DW_AT_decl_line   : 197
    <dd7>   DW_AT_type        : <0xed3>
    <ddb>   DW_AT_data_member_location: 22
 <2><ddc>: Abbrev Number: 11 (DW_TAG_member)
    <ddd>   DW_AT_name        : (indirect string, offset: 0x8b9): _seek
    <de1>   DW_AT_decl_file   : 5
    <de2>   DW_AT_decl_line   : 200
    <de3>   DW_AT_type        : <0xef7>
    <de7>   DW_AT_data_member_location: 24
 <2><de8>: Abbrev Number: 11 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0x6d5): _close
    <ded>   DW_AT_decl_file   : 5
    <dee>   DW_AT_decl_line   : 201
    <def>   DW_AT_type        : <0xf11>
    <df3>   DW_AT_data_member_location: 26
 <2><df4>: Abbrev Number: 14 (DW_TAG_member)
    <df5>   DW_AT_name        : _ub
    <df9>   DW_AT_decl_file   : 5
    <dfa>   DW_AT_decl_line   : 204
    <dfb>   DW_AT_type        : <0xb64>
    <dff>   DW_AT_data_member_location: 28
 <2><e00>: Abbrev Number: 14 (DW_TAG_member)
    <e01>   DW_AT_name        : _up
    <e05>   DW_AT_decl_file   : 5
    <e06>   DW_AT_decl_line   : 205
    <e07>   DW_AT_type        : <0xb89>
    <e0b>   DW_AT_data_member_location: 32
 <2><e0c>: Abbrev Number: 14 (DW_TAG_member)
    <e0d>   DW_AT_name        : _ur
    <e11>   DW_AT_decl_file   : 5
    <e12>   DW_AT_decl_line   : 206
    <e13>   DW_AT_type        : <0x8dd>
    <e17>   DW_AT_data_member_location: 34
 <2><e18>: Abbrev Number: 11 (DW_TAG_member)
    <e19>   DW_AT_name        : (indirect string, offset: 0x6e5): _ubuf
    <e1d>   DW_AT_decl_file   : 5
    <e1e>   DW_AT_decl_line   : 209
    <e1f>   DW_AT_type        : <0xf17>
    <e23>   DW_AT_data_member_location: 36
 <2><e24>: Abbrev Number: 11 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0x5e9): _nbuf
    <e29>   DW_AT_decl_file   : 5
    <e2a>   DW_AT_decl_line   : 210
    <e2b>   DW_AT_type        : <0xf27>
    <e2f>   DW_AT_data_member_location: 39
 <2><e30>: Abbrev Number: 14 (DW_TAG_member)
    <e31>   DW_AT_name        : _lb
    <e35>   DW_AT_decl_file   : 5
    <e36>   DW_AT_decl_line   : 213
    <e37>   DW_AT_type        : <0xb64>
    <e3b>   DW_AT_data_member_location: 40
 <2><e3c>: Abbrev Number: 11 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x917): _blksize
    <e41>   DW_AT_decl_file   : 5
    <e42>   DW_AT_decl_line   : 216
    <e43>   DW_AT_type        : <0x8dd>
    <e47>   DW_AT_data_member_location: 44
 <2><e48>: Abbrev Number: 11 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0x508): _offset
    <e4d>   DW_AT_decl_file   : 5
    <e4e>   DW_AT_decl_line   : 217
    <e4f>   DW_AT_type        : <0x940>
    <e53>   DW_AT_data_member_location: 46
 <2><e54>: Abbrev Number: 11 (DW_TAG_member)
    <e55>   DW_AT_name        : (indirect string, offset: 0x688): _lock
    <e59>   DW_AT_decl_file   : 5
    <e5a>   DW_AT_decl_line   : 224
    <e5b>   DW_AT_type        : <0x9bd>
    <e5f>   DW_AT_data_member_location: 50
 <2><e60>: Abbrev Number: 11 (DW_TAG_member)
    <e61>   DW_AT_name        : (indirect string, offset: 0x660): _mbstate
    <e65>   DW_AT_decl_file   : 5
    <e66>   DW_AT_decl_line   : 226
    <e67>   DW_AT_type        : <0x9b2>
    <e6b>   DW_AT_data_member_location: 52
 <2><e6c>: Abbrev Number: 11 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x496): _flags2
    <e71>   DW_AT_decl_file   : 5
    <e72>   DW_AT_decl_line   : 227
    <e73>   DW_AT_type        : <0x8dd>
    <e77>   DW_AT_data_member_location: 58
 <2><e78>: Abbrev Number: 0
 <1><e79>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <e7a>   DW_AT_prototyped  : 1
    <e7a>   DW_AT_type        : <0x8dd>
    <e7e>   DW_AT_sibling     : <0xe97>
 <2><e82>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <e83>   DW_AT_type        : <0xd44>
 <2><e87>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <e88>   DW_AT_type        : <0x9c8>
 <2><e8c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <e8d>   DW_AT_type        : <0xe97>
 <2><e91>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <e92>   DW_AT_type        : <0x8dd>
 <2><e96>: Abbrev Number: 0
 <1><e97>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <e98>   DW_AT_byte_size   : 2
    <e99>   DW_AT_type        : <0xe9d>
 <1><e9d>: Abbrev Number: 4 (DW_TAG_base_type)
    <e9e>   DW_AT_byte_size   : 1
    <e9f>   DW_AT_encoding    : 8	(unsigned char)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x293): char
 <1><ea4>: Abbrev Number: 17 (DW_TAG_const_type)
    <ea5>   DW_AT_type        : <0xe9d>
 <1><ea9>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <eaa>   DW_AT_byte_size   : 2
    <eab>   DW_AT_type        : <0xe79>
 <1><eaf>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <eb0>   DW_AT_prototyped  : 1
    <eb0>   DW_AT_type        : <0x8dd>
    <eb4>   DW_AT_sibling     : <0xecd>
 <2><eb8>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <eb9>   DW_AT_type        : <0xd44>
 <2><ebd>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ebe>   DW_AT_type        : <0x9c8>
 <2><ec2>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ec3>   DW_AT_type        : <0xecd>
 <2><ec7>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ec8>   DW_AT_type        : <0x8dd>
 <2><ecc>: Abbrev Number: 0
 <1><ecd>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <ece>   DW_AT_byte_size   : 2
    <ecf>   DW_AT_type        : <0xea4>
 <1><ed3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <ed4>   DW_AT_byte_size   : 2
    <ed5>   DW_AT_type        : <0xeaf>
 <1><ed9>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <eda>   DW_AT_prototyped  : 1
    <eda>   DW_AT_type        : <0x94b>
    <ede>   DW_AT_sibling     : <0xef7>
 <2><ee2>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ee3>   DW_AT_type        : <0xd44>
 <2><ee7>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ee8>   DW_AT_type        : <0x9c8>
 <2><eec>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <eed>   DW_AT_type        : <0x94b>
 <2><ef1>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ef2>   DW_AT_type        : <0x8dd>
 <2><ef6>: Abbrev Number: 0
 <1><ef7>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <ef8>   DW_AT_byte_size   : 2
    <ef9>   DW_AT_type        : <0xed9>
 <1><efd>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <efe>   DW_AT_prototyped  : 1
    <efe>   DW_AT_type        : <0x8dd>
    <f02>   DW_AT_sibling     : <0xf11>
 <2><f06>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <f07>   DW_AT_type        : <0xd44>
 <2><f0b>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <f0c>   DW_AT_type        : <0x9c8>
 <2><f10>: Abbrev Number: 0
 <1><f11>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f12>   DW_AT_byte_size   : 2
    <f13>   DW_AT_type        : <0xefd>
 <1><f17>: Abbrev Number: 8 (DW_TAG_array_type)
    <f18>   DW_AT_type        : <0x912>
    <f1c>   DW_AT_sibling     : <0xf27>
 <2><f20>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <f21>   DW_AT_type        : <0x8ef>
    <f25>   DW_AT_upper_bound : 2
 <2><f26>: Abbrev Number: 0
 <1><f27>: Abbrev Number: 8 (DW_TAG_array_type)
    <f28>   DW_AT_type        : <0x912>
    <f2c>   DW_AT_sibling     : <0xf37>
 <2><f30>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <f31>   DW_AT_type        : <0x8ef>
    <f35>   DW_AT_upper_bound : 0
 <2><f36>: Abbrev Number: 0
 <1><f37>: Abbrev Number: 5 (DW_TAG_typedef)
    <f38>   DW_AT_name        : (indirect string, offset: 0x60a): __FILE
    <f3c>   DW_AT_decl_file   : 5
    <f3d>   DW_AT_decl_line   : 285
    <f3f>   DW_AT_type        : <0xd4f>
 <1><f43>: Abbrev Number: 18 (DW_TAG_structure_type)
    <f44>   DW_AT_name        : (indirect string, offset: 0x787): _glue
    <f48>   DW_AT_byte_size   : 6
    <f49>   DW_AT_decl_file   : 5
    <f4a>   DW_AT_decl_line   : 289
    <f4c>   DW_AT_sibling     : <0xf78>
 <2><f50>: Abbrev Number: 19 (DW_TAG_member)
    <f51>   DW_AT_name        : (indirect string, offset: 0x7e3): _next
    <f55>   DW_AT_decl_file   : 5
    <f56>   DW_AT_decl_line   : 291
    <f58>   DW_AT_type        : <0xf78>
    <f5c>   DW_AT_data_member_location: 0
 <2><f5d>: Abbrev Number: 19 (DW_TAG_member)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x49e): _niobs
    <f62>   DW_AT_decl_file   : 5
    <f63>   DW_AT_decl_line   : 292
    <f65>   DW_AT_type        : <0x8dd>
    <f69>   DW_AT_data_member_location: 2
 <2><f6a>: Abbrev Number: 19 (DW_TAG_member)
    <f6b>   DW_AT_name        : (indirect string, offset: 0x490): _iobs
    <f6f>   DW_AT_decl_file   : 5
    <f70>   DW_AT_decl_line   : 293
    <f72>   DW_AT_type        : <0xf7e>
    <f76>   DW_AT_data_member_location: 4
 <2><f77>: Abbrev Number: 0
 <1><f78>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f79>   DW_AT_byte_size   : 2
    <f7a>   DW_AT_type        : <0xf43>
 <1><f7e>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f7f>   DW_AT_byte_size   : 2
    <f80>   DW_AT_type        : <0xf37>
 <1><f84>: Abbrev Number: 18 (DW_TAG_structure_type)
    <f85>   DW_AT_name        : (indirect string, offset: 0x89f): _rand48
    <f89>   DW_AT_byte_size   : 22
    <f8a>   DW_AT_decl_file   : 5
    <f8b>   DW_AT_decl_line   : 317
    <f8d>   DW_AT_sibling     : <0xfc6>
 <2><f91>: Abbrev Number: 19 (DW_TAG_member)
    <f92>   DW_AT_name        : (indirect string, offset: 0x899): _seed
    <f96>   DW_AT_decl_file   : 5
    <f97>   DW_AT_decl_line   : 318
    <f99>   DW_AT_type        : <0xfc6>
    <f9d>   DW_AT_data_member_location: 0
 <2><f9e>: Abbrev Number: 19 (DW_TAG_member)
    <f9f>   DW_AT_name        : (indirect string, offset: 0x68e): _mult
    <fa3>   DW_AT_decl_file   : 5
    <fa4>   DW_AT_decl_line   : 319
    <fa6>   DW_AT_type        : <0xfc6>
    <faa>   DW_AT_data_member_location: 6
 <2><fab>: Abbrev Number: 19 (DW_TAG_member)
    <fac>   DW_AT_name        : (indirect string, offset: 0x4e8): _add
    <fb0>   DW_AT_decl_file   : 5
    <fb1>   DW_AT_decl_line   : 320
    <fb3>   DW_AT_type        : <0x920>
    <fb7>   DW_AT_data_member_location: 12
 <2><fb8>: Abbrev Number: 19 (DW_TAG_member)
    <fb9>   DW_AT_name        : (indirect string, offset: 0x7de): _rand_next
    <fbd>   DW_AT_decl_file   : 5
    <fbe>   DW_AT_decl_line   : 323
    <fc0>   DW_AT_type        : <0x92e>
    <fc4>   DW_AT_data_member_location: 14
 <2><fc5>: Abbrev Number: 0
 <1><fc6>: Abbrev Number: 8 (DW_TAG_array_type)
    <fc7>   DW_AT_type        : <0x920>
    <fcb>   DW_AT_sibling     : <0xfd6>
 <2><fcf>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <fd0>   DW_AT_type        : <0x8ef>
    <fd4>   DW_AT_upper_bound : 2
 <2><fd5>: Abbrev Number: 0
 <1><fd6>: Abbrev Number: 18 (DW_TAG_structure_type)
    <fd7>   DW_AT_name        : (indirect string, offset: 0x792): _mprec
    <fdb>   DW_AT_byte_size   : 8
    <fdc>   DW_AT_decl_file   : 5
    <fdd>   DW_AT_decl_line   : 342
    <fdf>   DW_AT_sibling     : <0x1018>
 <2><fe3>: Abbrev Number: 19 (DW_TAG_member)
    <fe4>   DW_AT_name        : (indirect string, offset: 0x8d0): _result
    <fe8>   DW_AT_decl_file   : 5
    <fe9>   DW_AT_decl_line   : 345
    <feb>   DW_AT_type        : <0xa28>
    <fef>   DW_AT_data_member_location: 0
 <2><ff0>: Abbrev Number: 19 (DW_TAG_member)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x4ed): _result_k
    <ff5>   DW_AT_decl_file   : 5
    <ff6>   DW_AT_decl_line   : 346
    <ff8>   DW_AT_type        : <0x8dd>
    <ffc>   DW_AT_data_member_location: 2
 <2><ffd>: Abbrev Number: 19 (DW_TAG_member)
    <ffe>   DW_AT_name        : (indirect string, offset: 0x955): _p5s
    <1002>   DW_AT_decl_file   : 5
    <1003>   DW_AT_decl_line   : 347
    <1005>   DW_AT_type        : <0xa28>
    <1009>   DW_AT_data_member_location: 4
 <2><100a>: Abbrev Number: 19 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0x638): _freelist
    <100f>   DW_AT_decl_file   : 5
    <1010>   DW_AT_decl_line   : 348
    <1012>   DW_AT_type        : <0x1018>
    <1016>   DW_AT_data_member_location: 6
 <2><1017>: Abbrev Number: 0
 <1><1018>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1019>   DW_AT_byte_size   : 2
    <101a>   DW_AT_type        : <0xa28>
 <1><101e>: Abbrev Number: 18 (DW_TAG_structure_type)
    <101f>   DW_AT_name        : (indirect string, offset: 0x972): _misc_reent
    <1023>   DW_AT_byte_size   : 60
    <1024>   DW_AT_decl_file   : 5
    <1025>   DW_AT_decl_line   : 352
    <1027>   DW_AT_sibling     : <0x10bb>
 <2><102b>: Abbrev Number: 19 (DW_TAG_member)
    <102c>   DW_AT_name        : (indirect string, offset: 0x88c): _strtok_last
    <1030>   DW_AT_decl_file   : 5
    <1031>   DW_AT_decl_line   : 355
    <1033>   DW_AT_type        : <0xe97>
    <1037>   DW_AT_data_member_location: 0
 <2><1038>: Abbrev Number: 19 (DW_TAG_member)
    <1039>   DW_AT_name        : (indirect string, offset: 0x4a5): _mblen_state
    <103d>   DW_AT_decl_file   : 5
    <103e>   DW_AT_decl_line   : 356
    <1040>   DW_AT_type        : <0x9b2>
    <1044>   DW_AT_data_member_location: 2
 <2><1045>: Abbrev Number: 19 (DW_TAG_member)
    <1046>   DW_AT_name        : (indirect string, offset: 0x932): _wctomb_state
    <104a>   DW_AT_decl_file   : 5
    <104b>   DW_AT_decl_line   : 357
    <104d>   DW_AT_type        : <0x9b2>
    <1051>   DW_AT_data_member_location: 8
 <2><1052>: Abbrev Number: 19 (DW_TAG_member)
    <1053>   DW_AT_name        : (indirect string, offset: 0x79e): _mbtowc_state
    <1057>   DW_AT_decl_file   : 5
    <1058>   DW_AT_decl_line   : 358
    <105a>   DW_AT_type        : <0x9b2>
    <105e>   DW_AT_data_member_location: 14
 <2><105f>: Abbrev Number: 19 (DW_TAG_member)
    <1060>   DW_AT_name        : (indirect string, offset: 0x4b2): _l64a_buf
    <1064>   DW_AT_decl_file   : 5
    <1065>   DW_AT_decl_line   : 359
    <1067>   DW_AT_type        : <0x10bb>
    <106b>   DW_AT_data_member_location: 20
 <2><106c>: Abbrev Number: 19 (DW_TAG_member)
    <106d>   DW_AT_name        : (indirect string, offset: 0x618): _getdate_err
    <1071>   DW_AT_decl_file   : 5
    <1072>   DW_AT_decl_line   : 360
    <1074>   DW_AT_type        : <0x8dd>
    <1078>   DW_AT_data_member_location: 28
 <2><1079>: Abbrev Number: 19 (DW_TAG_member)
    <107a>   DW_AT_name        : (indirect string, offset: 0x7b3): _mbrlen_state
    <107e>   DW_AT_decl_file   : 5
    <107f>   DW_AT_decl_line   : 361
    <1081>   DW_AT_type        : <0x9b2>
    <1085>   DW_AT_data_member_location: 30
 <2><1086>: Abbrev Number: 19 (DW_TAG_member)
    <1087>   DW_AT_name        : (indirect string, offset: 0x744): _mbrtowc_state
    <108b>   DW_AT_decl_file   : 5
    <108c>   DW_AT_decl_line   : 362
    <108e>   DW_AT_type        : <0x9b2>
    <1092>   DW_AT_data_member_location: 36
 <2><1093>: Abbrev Number: 19 (DW_TAG_member)
    <1094>   DW_AT_name        : (indirect string, offset: 0x5c3): _mbsrtowcs_state
    <1098>   DW_AT_decl_file   : 5
    <1099>   DW_AT_decl_line   : 363
    <109b>   DW_AT_type        : <0x9b2>
    <109f>   DW_AT_data_member_location: 42
 <2><10a0>: Abbrev Number: 19 (DW_TAG_member)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x98e): _wcrtomb_state
    <10a5>   DW_AT_decl_file   : 5
    <10a6>   DW_AT_decl_line   : 364
    <10a8>   DW_AT_type        : <0x9b2>
    <10ac>   DW_AT_data_member_location: 48
 <2><10ad>: Abbrev Number: 19 (DW_TAG_member)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x521): _wcsrtombs_state
    <10b2>   DW_AT_decl_file   : 5
    <10b3>   DW_AT_decl_line   : 365
    <10b5>   DW_AT_type        : <0x9b2>
    <10b9>   DW_AT_data_member_location: 54
 <2><10ba>: Abbrev Number: 0
 <1><10bb>: Abbrev Number: 8 (DW_TAG_array_type)
    <10bc>   DW_AT_type        : <0xe9d>
    <10c0>   DW_AT_sibling     : <0x10cb>
 <2><10c4>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <10c5>   DW_AT_type        : <0x8ef>
    <10c9>   DW_AT_upper_bound : 7
 <2><10ca>: Abbrev Number: 0
 <1><10cb>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <10cc>   DW_AT_byte_size   : 2
    <10cd>   DW_AT_type        : <0xfd6>
 <1><10d1>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <10d2>   DW_AT_prototyped  : 1
    <10d2>   DW_AT_sibling     : <0x10dc>
 <2><10d6>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <10d7>   DW_AT_type        : <0xd44>
 <2><10db>: Abbrev Number: 0
 <1><10dc>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <10dd>   DW_AT_byte_size   : 2
    <10de>   DW_AT_type        : <0x10d1>
 <1><10e2>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <10e3>   DW_AT_byte_size   : 2
    <10e4>   DW_AT_type        : <0xf84>
 <1><10e8>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <10e9>   DW_AT_byte_size   : 2
    <10ea>   DW_AT_type        : <0xa3e>
 <1><10ee>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <10ef>   DW_AT_prototyped  : 1
    <10ef>   DW_AT_sibling     : <0x10f9>
 <2><10f3>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <10f4>   DW_AT_type        : <0x8dd>
 <2><10f8>: Abbrev Number: 0
 <1><10f9>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <10fa>   DW_AT_byte_size   : 2
    <10fb>   DW_AT_type        : <0x10ff>
 <1><10ff>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1100>   DW_AT_byte_size   : 2
    <1101>   DW_AT_type        : <0x10ee>
 <1><1105>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1106>   DW_AT_byte_size   : 2
    <1107>   DW_AT_type        : <0x101e>
 <1><110b>: Abbrev Number: 24 (DW_TAG_variable)
    <110c>   DW_AT_name        : (indirect string, offset: 0x69f): __sf_fake_stdin
    <1110>   DW_AT_decl_file   : 5
    <1111>   DW_AT_decl_line   : 419
    <1113>   DW_AT_type        : <0xbf9>
    <1117>   DW_AT_external    : 1
    <1117>   DW_AT_declaration : 1
 <1><1117>: Abbrev Number: 24 (DW_TAG_variable)
    <1118>   DW_AT_name        : (indirect string, offset: 0x8bf): __sf_fake_stdout
    <111c>   DW_AT_decl_file   : 5
    <111d>   DW_AT_decl_line   : 420
    <111f>   DW_AT_type        : <0xbf9>
    <1123>   DW_AT_external    : 1
    <1123>   DW_AT_declaration : 1
 <1><1123>: Abbrev Number: 24 (DW_TAG_variable)
    <1124>   DW_AT_name        : (indirect string, offset: 0x4f7): __sf_fake_stderr
    <1128>   DW_AT_decl_file   : 5
    <1129>   DW_AT_decl_line   : 421
    <112b>   DW_AT_type        : <0xbf9>
    <112f>   DW_AT_external    : 1
    <112f>   DW_AT_declaration : 1
 <1><112f>: Abbrev Number: 24 (DW_TAG_variable)
    <1130>   DW_AT_name        : (indirect string, offset: 0x6f2): _impure_ptr
    <1134>   DW_AT_decl_file   : 5
    <1135>   DW_AT_decl_line   : 765
    <1137>   DW_AT_type        : <0xd44>
    <113b>   DW_AT_external    : 1
    <113b>   DW_AT_declaration : 1
 <1><113b>: Abbrev Number: 24 (DW_TAG_variable)
    <113c>   DW_AT_name        : (indirect string, offset: 0x6eb): _global_impure_ptr
    <1140>   DW_AT_decl_file   : 5
    <1141>   DW_AT_decl_line   : 766
    <1143>   DW_AT_type        : <0xd4a>
    <1147>   DW_AT_external    : 1
    <1147>   DW_AT_declaration : 1
 <1><1147>: Abbrev Number: 25 (DW_TAG_subprogram)
    <1148>   DW_AT_external    : 1
    <1148>   DW_AT_name        : (indirect string, offset: 0x714): memmove
    <114c>   DW_AT_decl_file   : 6
    <114d>   DW_AT_decl_line   : 24
    <114e>   DW_AT_prototyped  : 1
    <114e>   DW_AT_type        : <0x9c8>
    <1152>   DW_AT_low_pc      : 0xc210
    <1156>   DW_AT_high_pc     : 0x38
    <115a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <115c>   DW_AT_GNU_all_call_sites: 1
    <115c>   DW_AT_sibling     : <0x11aa>
 <2><1160>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <1161>   DW_AT_name        : (indirect string, offset: 0x940): dst_void
    <1165>   DW_AT_decl_file   : 1
    <1166>   DW_AT_decl_line   : 60
    <1167>   DW_AT_type        : <0x9c8>
    <116b>   DW_AT_location    : 1 byte block: 5c 	(DW_OP_reg12 (r12))
 <2><116d>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <116e>   DW_AT_name        : (indirect string, offset: 0x753): src_void
    <1172>   DW_AT_decl_file   : 1
    <1173>   DW_AT_decl_line   : 60
    <1174>   DW_AT_type        : <0x11aa>
    <1178>   DW_AT_location    : 0x0 (location list)
 <2><117c>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <117d>   DW_AT_name        : (indirect string, offset: 0x642): length
    <1181>   DW_AT_decl_file   : 1
    <1182>   DW_AT_decl_line   : 60
    <1183>   DW_AT_type        : <0x8e4>
    <1187>   DW_AT_location    : 0x45 (location list)
 <2><118b>: Abbrev Number: 28 (DW_TAG_variable)
    <118c>   DW_AT_name        : dst
    <1190>   DW_AT_decl_file   : 1
    <1191>   DW_AT_decl_line   : 66
    <1192>   DW_AT_type        : <0xe97>
    <1196>   DW_AT_location    : 0xaf (location list)
 <2><119a>: Abbrev Number: 28 (DW_TAG_variable)
    <119b>   DW_AT_name        : src
    <119f>   DW_AT_decl_file   : 1
    <11a0>   DW_AT_decl_line   : 67
    <11a1>   DW_AT_type        : <0xecd>
    <11a5>   DW_AT_location    : 0xf0 (location list)
 <2><11a9>: Abbrev Number: 0
 <1><11aa>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <11ab>   DW_AT_byte_size   : 2
    <11ac>   DW_AT_type        : <0x11b0>
 <1><11b0>: Abbrev Number: 29 (DW_TAG_const_type)
 <1><11b1>: Abbrev Number: 0
  Compilation Unit @ offset 0x11b2:
   Length:        0x8d2 (32-bit)
   Version:       4
   Abbrev Offset: 0x251
   Pointer Size:  4
 <0><11bd>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <11be>   DW_AT_producer    : (indirect string, offset: 0x7fc): GNU C11 7.3.1 -mcpu=msp430 -mhwmult=none -mOs -mcpu=msp430 -g -g -Os -O2 -Os -fno-builtin -ffunction-sections -fdata-sections
    <11c2>   DW_AT_language    : 12	(ANSI C99)
    <11c3>   DW_AT_name        : (indirect string, offset: 0x9b6): ../../../../../../../gcc/newlib/libc/string/memset.c
    <11c7>   DW_AT_comp_dir    : (indirect string, offset: 0x540): /home/nhivp/Downloads/msp430-gcc-7.3.1.24-source-full/build/gcc/msp430-elf/430/newlib/libc/string
    <11cb>   DW_AT_ranges      : 0x38
    <11cf>   DW_AT_low_pc      : 0x0
    <11d3>   DW_AT_stmt_list   : 0x49b
 <1><11d7>: Abbrev Number: 2 (DW_TAG_base_type)
    <11d8>   DW_AT_byte_size   : 2
    <11d9>   DW_AT_encoding    : 5	(signed)
    <11da>   DW_AT_name        : int
 <1><11de>: Abbrev Number: 3 (DW_TAG_typedef)
    <11df>   DW_AT_name        : (indirect string, offset: 0x4e1): size_t
    <11e3>   DW_AT_decl_file   : 2
    <11e4>   DW_AT_decl_line   : 216
    <11e5>   DW_AT_type        : <0x11e9>
 <1><11e9>: Abbrev Number: 4 (DW_TAG_base_type)
    <11ea>   DW_AT_byte_size   : 2
    <11eb>   DW_AT_encoding    : 7	(unsigned)
    <11ec>   DW_AT_name        : (indirect string, offset: 0x2cd): unsigned int
 <1><11f0>: Abbrev Number: 4 (DW_TAG_base_type)
    <11f1>   DW_AT_byte_size   : 4
    <11f2>   DW_AT_encoding    : 5	(signed)
    <11f3>   DW_AT_name        : (indirect string, offset: 0x200): long int
 <1><11f7>: Abbrev Number: 4 (DW_TAG_base_type)
    <11f8>   DW_AT_byte_size   : 8
    <11f9>   DW_AT_encoding    : 5	(signed)
    <11fa>   DW_AT_name        : (indirect string, offset: 0x1fb): long long int
 <1><11fe>: Abbrev Number: 4 (DW_TAG_base_type)
    <11ff>   DW_AT_byte_size   : 8
    <1200>   DW_AT_encoding    : 4	(float)
    <1201>   DW_AT_name        : (indirect string, offset: 0x6fe): long double
 <1><1205>: Abbrev Number: 4 (DW_TAG_base_type)
    <1206>   DW_AT_byte_size   : 1
    <1207>   DW_AT_encoding    : 6	(signed char)
    <1208>   DW_AT_name        : (indirect string, offset: 0x28c): signed char
 <1><120c>: Abbrev Number: 4 (DW_TAG_base_type)
    <120d>   DW_AT_byte_size   : 1
    <120e>   DW_AT_encoding    : 8	(unsigned char)
    <120f>   DW_AT_name        : (indirect string, offset: 0x28a): unsigned char
 <1><1213>: Abbrev Number: 4 (DW_TAG_base_type)
    <1214>   DW_AT_byte_size   : 2
    <1215>   DW_AT_encoding    : 5	(signed)
    <1216>   DW_AT_name        : (indirect string, offset: 0x4e): short int
 <1><121a>: Abbrev Number: 4 (DW_TAG_base_type)
    <121b>   DW_AT_byte_size   : 2
    <121c>   DW_AT_encoding    : 7	(unsigned)
    <121d>   DW_AT_name        : (indirect string, offset: 0x31d): short unsigned int
 <1><1221>: Abbrev Number: 4 (DW_TAG_base_type)
    <1222>   DW_AT_byte_size   : 4
    <1223>   DW_AT_encoding    : 7	(unsigned)
    <1224>   DW_AT_name        : (indirect string, offset: 0x2c8): long unsigned int
 <1><1228>: Abbrev Number: 4 (DW_TAG_base_type)
    <1229>   DW_AT_byte_size   : 8
    <122a>   DW_AT_encoding    : 7	(unsigned)
    <122b>   DW_AT_name        : (indirect string, offset: 0x2c3): long long unsigned int
 <1><122f>: Abbrev Number: 3 (DW_TAG_typedef)
    <1230>   DW_AT_name        : (indirect string, offset: 0x5ef): _LOCK_RECURSIVE_T
    <1234>   DW_AT_decl_file   : 3
    <1235>   DW_AT_decl_line   : 7
    <1236>   DW_AT_type        : <0x11d7>
 <1><123a>: Abbrev Number: 3 (DW_TAG_typedef)
    <123b>   DW_AT_name        : (indirect string, offset: 0x4bc): _off_t
    <123f>   DW_AT_decl_file   : 4
    <1240>   DW_AT_decl_line   : 16
    <1241>   DW_AT_type        : <0x11f0>
 <1><1245>: Abbrev Number: 3 (DW_TAG_typedef)
    <1246>   DW_AT_name        : (indirect string, offset: 0x6cd): _fpos_t
    <124a>   DW_AT_decl_file   : 4
    <124b>   DW_AT_decl_line   : 39
    <124c>   DW_AT_type        : <0x11f0>
 <1><1250>: Abbrev Number: 5 (DW_TAG_typedef)
    <1251>   DW_AT_name        : (indirect string, offset: 0x7ac): wint_t
    <1255>   DW_AT_decl_file   : 2
    <1256>   DW_AT_decl_line   : 357
    <1258>   DW_AT_type        : <0x11e9>
 <1><125c>: Abbrev Number: 6 (DW_TAG_union_type)
    <125d>   DW_AT_byte_size   : 4
    <125e>   DW_AT_decl_file   : 4
    <125f>   DW_AT_decl_line   : 74
    <1260>   DW_AT_sibling     : <0x127b>
 <2><1264>: Abbrev Number: 7 (DW_TAG_member)
    <1265>   DW_AT_name        : (indirect string, offset: 0x4c3): __wch
    <1269>   DW_AT_decl_file   : 4
    <126a>   DW_AT_decl_line   : 76
    <126b>   DW_AT_type        : <0x1250>
 <2><126f>: Abbrev Number: 7 (DW_TAG_member)
    <1270>   DW_AT_name        : (indirect string, offset: 0x722): __wchb
    <1274>   DW_AT_decl_file   : 4
    <1275>   DW_AT_decl_line   : 77
    <1276>   DW_AT_type        : <0x127b>
 <2><127a>: Abbrev Number: 0
 <1><127b>: Abbrev Number: 8 (DW_TAG_array_type)
    <127c>   DW_AT_type        : <0x120c>
    <1280>   DW_AT_sibling     : <0x128b>
 <2><1284>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <1285>   DW_AT_type        : <0x11e9>
    <1289>   DW_AT_upper_bound : 3
 <2><128a>: Abbrev Number: 0
 <1><128b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <128c>   DW_AT_byte_size   : 6
    <128d>   DW_AT_decl_file   : 4
    <128e>   DW_AT_decl_line   : 71
    <128f>   DW_AT_sibling     : <0x12ac>
 <2><1293>: Abbrev Number: 11 (DW_TAG_member)
    <1294>   DW_AT_name        : (indirect string, offset: 0x5ab): __count
    <1298>   DW_AT_decl_file   : 4
    <1299>   DW_AT_decl_line   : 73
    <129a>   DW_AT_type        : <0x11d7>
    <129e>   DW_AT_data_member_location: 0
 <2><129f>: Abbrev Number: 11 (DW_TAG_member)
    <12a0>   DW_AT_name        : (indirect string, offset: 0x4d2): __value
    <12a4>   DW_AT_decl_file   : 4
    <12a5>   DW_AT_decl_line   : 78
    <12a6>   DW_AT_type        : <0x125c>
    <12aa>   DW_AT_data_member_location: 2
 <2><12ab>: Abbrev Number: 0
 <1><12ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <12ad>   DW_AT_name        : (indirect string, offset: 0x7e9): _mbstate_t
    <12b1>   DW_AT_decl_file   : 4
    <12b2>   DW_AT_decl_line   : 79
    <12b3>   DW_AT_type        : <0x128b>
 <1><12b7>: Abbrev Number: 3 (DW_TAG_typedef)
    <12b8>   DW_AT_name        : (indirect string, offset: 0x6dc): _flock_t
    <12bc>   DW_AT_decl_file   : 4
    <12bd>   DW_AT_decl_line   : 83
    <12be>   DW_AT_type        : <0x122f>
 <1><12c2>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <12c3>   DW_AT_byte_size   : 2
 <1><12c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <12c5>   DW_AT_name        : (indirect string, offset: 0x8b1): __ULong
    <12c9>   DW_AT_decl_file   : 5
    <12ca>   DW_AT_decl_line   : 22
    <12cb>   DW_AT_type        : <0x1221>
 <1><12cf>: Abbrev Number: 13 (DW_TAG_structure_type)
    <12d0>   DW_AT_name        : (indirect string, offset: 0x7f4): _Bigint
    <12d4>   DW_AT_byte_size   : 14
    <12d5>   DW_AT_decl_file   : 5
    <12d6>   DW_AT_decl_line   : 45
    <12d7>   DW_AT_sibling     : <0x1322>
 <2><12db>: Abbrev Number: 11 (DW_TAG_member)
    <12dc>   DW_AT_name        : (indirect string, offset: 0x7e3): _next
    <12e0>   DW_AT_decl_file   : 5
    <12e1>   DW_AT_decl_line   : 47
    <12e2>   DW_AT_type        : <0x1322>
    <12e6>   DW_AT_data_member_location: 0
 <2><12e7>: Abbrev Number: 14 (DW_TAG_member)
    <12e8>   DW_AT_name        : _k
    <12eb>   DW_AT_decl_file   : 5
    <12ec>   DW_AT_decl_line   : 48
    <12ed>   DW_AT_type        : <0x11d7>
    <12f1>   DW_AT_data_member_location: 2
 <2><12f2>: Abbrev Number: 11 (DW_TAG_member)
    <12f3>   DW_AT_name        : (indirect string, offset: 0x87a): _maxwds
    <12f7>   DW_AT_decl_file   : 5
    <12f8>   DW_AT_decl_line   : 48
    <12f9>   DW_AT_type        : <0x11d7>
    <12fd>   DW_AT_data_member_location: 4
 <2><12fe>: Abbrev Number: 11 (DW_TAG_member)
    <12ff>   DW_AT_name        : (indirect string, offset: 0x95a): _sign
    <1303>   DW_AT_decl_file   : 5
    <1304>   DW_AT_decl_line   : 48
    <1305>   DW_AT_type        : <0x11d7>
    <1309>   DW_AT_data_member_location: 6
 <2><130a>: Abbrev Number: 11 (DW_TAG_member)
    <130b>   DW_AT_name        : (indirect string, offset: 0x78d): _wds
    <130f>   DW_AT_decl_file   : 5
    <1310>   DW_AT_decl_line   : 48
    <1311>   DW_AT_type        : <0x11d7>
    <1315>   DW_AT_data_member_location: 8
 <2><1316>: Abbrev Number: 14 (DW_TAG_member)
    <1317>   DW_AT_name        : _x
    <131a>   DW_AT_decl_file   : 5
    <131b>   DW_AT_decl_line   : 49
    <131c>   DW_AT_type        : <0x1328>
    <1320>   DW_AT_data_member_location: 10
 <2><1321>: Abbrev Number: 0
 <1><1322>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1323>   DW_AT_byte_size   : 2
    <1324>   DW_AT_type        : <0x12cf>
 <1><1328>: Abbrev Number: 8 (DW_TAG_array_type)
    <1329>   DW_AT_type        : <0x12c4>
    <132d>   DW_AT_sibling     : <0x1338>
 <2><1331>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <1332>   DW_AT_type        : <0x11e9>
    <1336>   DW_AT_upper_bound : 0
 <2><1337>: Abbrev Number: 0
 <1><1338>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1339>   DW_AT_name        : (indirect string, offset: 0x799): __tm
    <133d>   DW_AT_byte_size   : 18
    <133e>   DW_AT_decl_file   : 5
    <133f>   DW_AT_decl_line   : 53
    <1340>   DW_AT_sibling     : <0x13b1>
 <2><1344>: Abbrev Number: 11 (DW_TAG_member)
    <1345>   DW_AT_name        : (indirect string, offset: 0x601): __tm_sec
    <1349>   DW_AT_decl_file   : 5
    <134a>   DW_AT_decl_line   : 55
    <134b>   DW_AT_type        : <0x11d7>
    <134f>   DW_AT_data_member_location: 0
 <2><1350>: Abbrev Number: 11 (DW_TAG_member)
    <1351>   DW_AT_name        : (indirect string, offset: 0x625): __tm_min
    <1355>   DW_AT_decl_file   : 5
    <1356>   DW_AT_decl_line   : 56
    <1357>   DW_AT_type        : <0x11d7>
    <135b>   DW_AT_data_member_location: 2
 <2><135c>: Abbrev Number: 11 (DW_TAG_member)
    <135d>   DW_AT_name        : (indirect string, offset: 0x70a): __tm_hour
    <1361>   DW_AT_decl_file   : 5
    <1362>   DW_AT_decl_line   : 57
    <1363>   DW_AT_type        : <0x11d7>
    <1367>   DW_AT_data_member_location: 4
 <2><1368>: Abbrev Number: 11 (DW_TAG_member)
    <1369>   DW_AT_name        : (indirect string, offset: 0x5b3): __tm_mday
    <136d>   DW_AT_decl_file   : 5
    <136e>   DW_AT_decl_line   : 58
    <136f>   DW_AT_type        : <0x11d7>
    <1373>   DW_AT_data_member_location: 6
 <2><1374>: Abbrev Number: 11 (DW_TAG_member)
    <1375>   DW_AT_name        : (indirect string, offset: 0x8d8): __tm_mon
    <1379>   DW_AT_decl_file   : 5
    <137a>   DW_AT_decl_line   : 59
    <137b>   DW_AT_type        : <0x11d7>
    <137f>   DW_AT_data_member_location: 8
 <2><1380>: Abbrev Number: 11 (DW_TAG_member)
    <1381>   DW_AT_name        : (indirect string, offset: 0x882): __tm_year
    <1385>   DW_AT_decl_file   : 5
    <1386>   DW_AT_decl_line   : 60
    <1387>   DW_AT_type        : <0x11d7>
    <138b>   DW_AT_data_member_location: 10
 <2><138c>: Abbrev Number: 11 (DW_TAG_member)
    <138d>   DW_AT_name        : (indirect string, offset: 0x669): __tm_wday
    <1391>   DW_AT_decl_file   : 5
    <1392>   DW_AT_decl_line   : 61
    <1393>   DW_AT_type        : <0x11d7>
    <1397>   DW_AT_data_member_location: 12
 <2><1398>: Abbrev Number: 11 (DW_TAG_member)
    <1399>   DW_AT_name        : (indirect string, offset: 0x8a7): __tm_yday
    <139d>   DW_AT_decl_file   : 5
    <139e>   DW_AT_decl_line   : 62
    <139f>   DW_AT_type        : <0x11d7>
    <13a3>   DW_AT_data_member_location: 14
 <2><13a4>: Abbrev Number: 11 (DW_TAG_member)
    <13a5>   DW_AT_name        : (indirect string, offset: 0x694): __tm_isdst
    <13a9>   DW_AT_decl_file   : 5
    <13aa>   DW_AT_decl_line   : 63
    <13ab>   DW_AT_type        : <0x11d7>
    <13af>   DW_AT_data_member_location: 16
 <2><13b0>: Abbrev Number: 0
 <1><13b1>: Abbrev Number: 13 (DW_TAG_structure_type)
    <13b2>   DW_AT_name        : (indirect string, offset: 0x736): _on_exit_args
    <13b6>   DW_AT_byte_size   : 136
    <13b7>   DW_AT_decl_file   : 5
    <13b8>   DW_AT_decl_line   : 72
    <13b9>   DW_AT_sibling     : <0x13ee>
 <2><13bd>: Abbrev Number: 11 (DW_TAG_member)
    <13be>   DW_AT_name        : (indirect string, offset: 0x673): _fnargs
    <13c2>   DW_AT_decl_file   : 5
    <13c3>   DW_AT_decl_line   : 73
    <13c4>   DW_AT_type        : <0x13ee>
    <13c8>   DW_AT_data_member_location: 0
 <2><13c9>: Abbrev Number: 11 (DW_TAG_member)
    <13ca>   DW_AT_name        : (indirect string, offset: 0x949): _dso_handle
    <13ce>   DW_AT_decl_file   : 5
    <13cf>   DW_AT_decl_line   : 74
    <13d0>   DW_AT_type        : <0x13ee>
    <13d4>   DW_AT_data_member_location: 64
 <2><13d5>: Abbrev Number: 11 (DW_TAG_member)
    <13d6>   DW_AT_name        : (indirect string, offset: 0x6c4): _fntypes
    <13da>   DW_AT_decl_file   : 5
    <13db>   DW_AT_decl_line   : 76
    <13dc>   DW_AT_type        : <0x12c4>
    <13e0>   DW_AT_data_member_location: 128
 <2><13e1>: Abbrev Number: 11 (DW_TAG_member)
    <13e2>   DW_AT_name        : (indirect string, offset: 0x7cc): _is_cxa
    <13e6>   DW_AT_decl_file   : 5
    <13e7>   DW_AT_decl_line   : 79
    <13e8>   DW_AT_type        : <0x12c4>
    <13ec>   DW_AT_data_member_location: 132
 <2><13ed>: Abbrev Number: 0
 <1><13ee>: Abbrev Number: 8 (DW_TAG_array_type)
    <13ef>   DW_AT_type        : <0x12c2>
    <13f3>   DW_AT_sibling     : <0x13fe>
 <2><13f7>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <13f8>   DW_AT_type        : <0x11e9>
    <13fc>   DW_AT_upper_bound : 31
 <2><13fd>: Abbrev Number: 0
 <1><13fe>: Abbrev Number: 13 (DW_TAG_structure_type)
    <13ff>   DW_AT_name        : (indirect string, offset: 0x5d9): _atexit
    <1403>   DW_AT_byte_size   : 70
    <1404>   DW_AT_decl_file   : 5
    <1405>   DW_AT_decl_line   : 83
    <1406>   DW_AT_sibling     : <0x143b>
 <2><140a>: Abbrev Number: 11 (DW_TAG_member)
    <140b>   DW_AT_name        : (indirect string, offset: 0x7e3): _next
    <140f>   DW_AT_decl_file   : 5
    <1410>   DW_AT_decl_line   : 84
    <1411>   DW_AT_type        : <0x143b>
    <1415>   DW_AT_data_member_location: 0
 <2><1416>: Abbrev Number: 11 (DW_TAG_member)
    <1417>   DW_AT_name        : (indirect string, offset: 0x92d): _ind
    <141b>   DW_AT_decl_file   : 5
    <141c>   DW_AT_decl_line   : 85
    <141d>   DW_AT_type        : <0x11d7>
    <1421>   DW_AT_data_member_location: 2
 <2><1422>: Abbrev Number: 11 (DW_TAG_member)
    <1423>   DW_AT_name        : (indirect string, offset: 0x649): _fns
    <1427>   DW_AT_decl_file   : 5
    <1428>   DW_AT_decl_line   : 86
    <1429>   DW_AT_type        : <0x1441>
    <142d>   DW_AT_data_member_location: 4
 <2><142e>: Abbrev Number: 11 (DW_TAG_member)
    <142f>   DW_AT_name        : (indirect string, offset: 0x64e): _on_exit_args_ptr
    <1433>   DW_AT_decl_file   : 5
    <1434>   DW_AT_decl_line   : 87
    <1435>   DW_AT_type        : <0x1458>
    <1439>   DW_AT_data_member_location: 68
 <2><143a>: Abbrev Number: 0
 <1><143b>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <143c>   DW_AT_byte_size   : 2
    <143d>   DW_AT_type        : <0x13fe>
 <1><1441>: Abbrev Number: 8 (DW_TAG_array_type)
    <1442>   DW_AT_type        : <0x1451>
    <1446>   DW_AT_sibling     : <0x1451>
 <2><144a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <144b>   DW_AT_type        : <0x11e9>
    <144f>   DW_AT_upper_bound : 31
 <2><1450>: Abbrev Number: 0
 <1><1451>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1452>   DW_AT_byte_size   : 2
    <1453>   DW_AT_type        : <0x1457>
 <1><1457>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <1458>   DW_AT_prototyped  : 1
 <1><1458>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1459>   DW_AT_byte_size   : 2
    <145a>   DW_AT_type        : <0x13b1>
 <1><145e>: Abbrev Number: 13 (DW_TAG_structure_type)
    <145f>   DW_AT_name        : (indirect string, offset: 0x4da): __sbuf
    <1463>   DW_AT_byte_size   : 4
    <1464>   DW_AT_decl_file   : 5
    <1465>   DW_AT_decl_line   : 115
    <1466>   DW_AT_sibling     : <0x1483>
 <2><146a>: Abbrev Number: 11 (DW_TAG_member)
    <146b>   DW_AT_name        : (indirect string, offset: 0x76c): _base
    <146f>   DW_AT_decl_file   : 5
    <1470>   DW_AT_decl_line   : 116
    <1471>   DW_AT_type        : <0x1483>
    <1475>   DW_AT_data_member_location: 0
 <2><1476>: Abbrev Number: 11 (DW_TAG_member)
    <1477>   DW_AT_name        : (indirect string, offset: 0x9a8): _size
    <147b>   DW_AT_decl_file   : 5
    <147c>   DW_AT_decl_line   : 117
    <147d>   DW_AT_type        : <0x11d7>
    <1481>   DW_AT_data_member_location: 2
 <2><1482>: Abbrev Number: 0
 <1><1483>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1484>   DW_AT_byte_size   : 2
    <1485>   DW_AT_type        : <0x120c>
 <1><1489>: Abbrev Number: 13 (DW_TAG_structure_type)
    <148a>   DW_AT_name        : (indirect string, offset: 0x920): __sFILE_fake
    <148e>   DW_AT_byte_size   : 18
    <148f>   DW_AT_decl_file   : 5
    <1490>   DW_AT_decl_line   : 151
    <1491>   DW_AT_sibling     : <0x14f3>
 <2><1495>: Abbrev Number: 14 (DW_TAG_member)
    <1496>   DW_AT_name        : _p
    <1499>   DW_AT_decl_file   : 5
    <149a>   DW_AT_decl_line   : 152
    <149b>   DW_AT_type        : <0x1483>
    <149f>   DW_AT_data_member_location: 0
 <2><14a0>: Abbrev Number: 14 (DW_TAG_member)
    <14a1>   DW_AT_name        : _r
    <14a4>   DW_AT_decl_file   : 5
    <14a5>   DW_AT_decl_line   : 153
    <14a6>   DW_AT_type        : <0x11d7>
    <14aa>   DW_AT_data_member_location: 2
 <2><14ab>: Abbrev Number: 14 (DW_TAG_member)
    <14ac>   DW_AT_name        : _w
    <14af>   DW_AT_decl_file   : 5
    <14b0>   DW_AT_decl_line   : 154
    <14b1>   DW_AT_type        : <0x11d7>
    <14b5>   DW_AT_data_member_location: 4
 <2><14b6>: Abbrev Number: 11 (DW_TAG_member)
    <14b7>   DW_AT_name        : (indirect string, offset: 0x532): _flags
    <14bb>   DW_AT_decl_file   : 5
    <14bc>   DW_AT_decl_line   : 155
    <14bd>   DW_AT_type        : <0x1213>
    <14c1>   DW_AT_data_member_location: 6
 <2><14c2>: Abbrev Number: 11 (DW_TAG_member)
    <14c3>   DW_AT_name        : (indirect string, offset: 0x772): _file
    <14c7>   DW_AT_decl_file   : 5
    <14c8>   DW_AT_decl_line   : 156
    <14c9>   DW_AT_type        : <0x1213>
    <14cd>   DW_AT_data_member_location: 8
 <2><14ce>: Abbrev Number: 14 (DW_TAG_member)
    <14cf>   DW_AT_name        : _bf
    <14d3>   DW_AT_decl_file   : 5
    <14d4>   DW_AT_decl_line   : 157
    <14d5>   DW_AT_type        : <0x145e>
    <14d9>   DW_AT_data_member_location: 10
 <2><14da>: Abbrev Number: 11 (DW_TAG_member)
    <14db>   DW_AT_name        : (indirect string, offset: 0x4c9): _lbfsize
    <14df>   DW_AT_decl_file   : 5
    <14e0>   DW_AT_decl_line   : 158
    <14e1>   DW_AT_type        : <0x11d7>
    <14e5>   DW_AT_data_member_location: 14
 <2><14e6>: Abbrev Number: 11 (DW_TAG_member)
    <14e7>   DW_AT_name        : (indirect string, offset: 0x6be): _data
    <14eb>   DW_AT_decl_file   : 5
    <14ec>   DW_AT_decl_line   : 160
    <14ed>   DW_AT_type        : <0x163e>
    <14f1>   DW_AT_data_member_location: 16
 <2><14f2>: Abbrev Number: 0
 <1><14f3>: Abbrev Number: 17 (DW_TAG_const_type)
    <14f4>   DW_AT_type        : <0x1489>
 <1><14f8>: Abbrev Number: 18 (DW_TAG_structure_type)
    <14f9>   DW_AT_name        : (indirect string, offset: 0x977): _reent
    <14fd>   DW_AT_byte_size   : 120
    <14fe>   DW_AT_decl_file   : 5
    <14ff>   DW_AT_decl_line   : 370
    <1501>   DW_AT_sibling     : <0x163e>
 <2><1505>: Abbrev Number: 19 (DW_TAG_member)
    <1506>   DW_AT_name        : (indirect string, offset: 0x611): _errno
    <150a>   DW_AT_decl_file   : 5
    <150b>   DW_AT_decl_line   : 374
    <150d>   DW_AT_type        : <0x11d7>
    <1511>   DW_AT_data_member_location: 0
 <2><1512>: Abbrev Number: 19 (DW_TAG_member)
    <1513>   DW_AT_name        : (indirect string, offset: 0x6a8): _stdin
    <1517>   DW_AT_decl_file   : 5
    <1518>   DW_AT_decl_line   : 379
    <151a>   DW_AT_type        : <0x1878>
    <151e>   DW_AT_data_member_location: 2
 <2><151f>: Abbrev Number: 19 (DW_TAG_member)
    <1520>   DW_AT_name        : (indirect string, offset: 0x8c8): _stdout
    <1524>   DW_AT_decl_file   : 5
    <1525>   DW_AT_decl_line   : 379
    <1527>   DW_AT_type        : <0x1878>
    <152b>   DW_AT_data_member_location: 4
 <2><152c>: Abbrev Number: 19 (DW_TAG_member)
    <152d>   DW_AT_name        : (indirect string, offset: 0x500): _stderr
    <1531>   DW_AT_decl_file   : 5
    <1532>   DW_AT_decl_line   : 379
    <1534>   DW_AT_type        : <0x1878>
    <1538>   DW_AT_data_member_location: 6
 <2><1539>: Abbrev Number: 19 (DW_TAG_member)
    <153a>   DW_AT_name        : (indirect string, offset: 0x729): _inc
    <153e>   DW_AT_decl_file   : 5
    <153f>   DW_AT_decl_line   : 381
    <1541>   DW_AT_type        : <0x11d7>
    <1545>   DW_AT_data_member_location: 8
 <2><1546>: Abbrev Number: 19 (DW_TAG_member)
    <1547>   DW_AT_name        : (indirect string, offset: 0x99d): _emergency
    <154b>   DW_AT_decl_file   : 5
    <154c>   DW_AT_decl_line   : 383
    <154e>   DW_AT_type        : <0x1791>
    <1552>   DW_AT_data_member_location: 10
 <2><1553>: Abbrev Number: 19 (DW_TAG_member)
    <1554>   DW_AT_name        : (indirect string, offset: 0x7c1): __sdidinit
    <1558>   DW_AT_decl_file   : 5
    <1559>   DW_AT_decl_line   : 385
    <155b>   DW_AT_type        : <0x11d7>
    <155f>   DW_AT_data_member_location: 12
 <2><1560>: Abbrev Number: 19 (DW_TAG_member)
    <1561>   DW_AT_name        : (indirect string, offset: 0x960): _current_category
    <1565>   DW_AT_decl_file   : 5
    <1566>   DW_AT_decl_line   : 387
    <1568>   DW_AT_type        : <0x11d7>
    <156c>   DW_AT_data_member_location: 14
 <2><156d>: Abbrev Number: 19 (DW_TAG_member)
    <156e>   DW_AT_name        : (indirect string, offset: 0x97e): _current_locale
    <1572>   DW_AT_decl_file   : 5
    <1573>   DW_AT_decl_line   : 388
    <1575>   DW_AT_type        : <0x17c7>
    <1579>   DW_AT_data_member_location: 16
 <2><157a>: Abbrev Number: 20 (DW_TAG_member)
    <157b>   DW_AT_name        : _mp
    <157f>   DW_AT_decl_file   : 5
    <1580>   DW_AT_decl_line   : 390
    <1582>   DW_AT_type        : <0x19c5>
    <1586>   DW_AT_data_member_location: 18
 <2><1587>: Abbrev Number: 19 (DW_TAG_member)
    <1588>   DW_AT_name        : (indirect string, offset: 0x7d4): __cleanup
    <158c>   DW_AT_decl_file   : 5
    <158d>   DW_AT_decl_line   : 392
    <158f>   DW_AT_type        : <0x19d6>
    <1593>   DW_AT_data_member_location: 20
 <2><1594>: Abbrev Number: 19 (DW_TAG_member)
    <1595>   DW_AT_name        : (indirect string, offset: 0x778): _gamma_signgam
    <1599>   DW_AT_decl_file   : 5
    <159a>   DW_AT_decl_line   : 394
    <159c>   DW_AT_type        : <0x11d7>
    <15a0>   DW_AT_data_member_location: 22
 <2><15a1>: Abbrev Number: 19 (DW_TAG_member)
    <15a2>   DW_AT_name        : (indirect string, offset: 0x5e1): _cvtlen
    <15a6>   DW_AT_decl_file   : 5
    <15a7>   DW_AT_decl_line   : 397
    <15a9>   DW_AT_type        : <0x11d7>
    <15ad>   DW_AT_data_member_location: 24
 <2><15ae>: Abbrev Number: 19 (DW_TAG_member)
    <15af>   DW_AT_name        : (indirect string, offset: 0x75c): _cvtbuf
    <15b3>   DW_AT_decl_file   : 5
    <15b4>   DW_AT_decl_line   : 398
    <15b6>   DW_AT_type        : <0x1791>
    <15ba>   DW_AT_data_member_location: 26
 <2><15bb>: Abbrev Number: 19 (DW_TAG_member)
    <15bc>   DW_AT_name        : (indirect string, offset: 0x5d4): _r48
    <15c0>   DW_AT_decl_file   : 5
    <15c1>   DW_AT_decl_line   : 400
    <15c3>   DW_AT_type        : <0x19dc>
    <15c7>   DW_AT_data_member_location: 28
 <2><15c8>: Abbrev Number: 19 (DW_TAG_member)
    <15c9>   DW_AT_name        : (indirect string, offset: 0x6af): _localtime_buf
    <15cd>   DW_AT_decl_file   : 5
    <15ce>   DW_AT_decl_line   : 401
    <15d0>   DW_AT_type        : <0x19e2>
    <15d4>   DW_AT_data_member_location: 30
 <2><15d5>: Abbrev Number: 19 (DW_TAG_member)
    <15d6>   DW_AT_name        : (indirect string, offset: 0x67b): _asctime_buf
    <15da>   DW_AT_decl_file   : 5
    <15db>   DW_AT_decl_line   : 402
    <15dd>   DW_AT_type        : <0x1791>
    <15e1>   DW_AT_data_member_location: 32
 <2><15e2>: Abbrev Number: 19 (DW_TAG_member)
    <15e3>   DW_AT_name        : (indirect string, offset: 0x62e): _sig_func
    <15e7>   DW_AT_decl_file   : 5
    <15e8>   DW_AT_decl_line   : 405
    <15ea>   DW_AT_type        : <0x19f3>
    <15ee>   DW_AT_data_member_location: 34
 <2><15ef>: Abbrev Number: 19 (DW_TAG_member)
    <15f0>   DW_AT_name        : (indirect string, offset: 0x5d9): _atexit
    <15f4>   DW_AT_decl_file   : 5
    <15f5>   DW_AT_decl_line   : 409
    <15f7>   DW_AT_type        : <0x143b>
    <15fb>   DW_AT_data_member_location: 36
 <2><15fc>: Abbrev Number: 19 (DW_TAG_member)
    <15fd>   DW_AT_name        : (indirect string, offset: 0x5a2): _atexit0
    <1601>   DW_AT_decl_file   : 5
    <1602>   DW_AT_decl_line   : 410
    <1604>   DW_AT_type        : <0x13fe>
    <1608>   DW_AT_data_member_location: 38
 <2><1609>: Abbrev Number: 19 (DW_TAG_member)
    <160a>   DW_AT_name        : (indirect string, offset: 0x72e): __sglue
    <160e>   DW_AT_decl_file   : 5
    <160f>   DW_AT_decl_line   : 413
    <1611>   DW_AT_type        : <0x183d>
    <1615>   DW_AT_data_member_location: 108
 <2><1616>: Abbrev Number: 19 (DW_TAG_member)
    <1617>   DW_AT_name        : (indirect string, offset: 0x510): __sf
    <161b>   DW_AT_decl_file   : 5
    <161c>   DW_AT_decl_line   : 414
    <161e>   DW_AT_type        : <0x1878>
    <1622>   DW_AT_data_member_location: 114
 <2><1623>: Abbrev Number: 19 (DW_TAG_member)
    <1624>   DW_AT_name        : (indirect string, offset: 0x5bd): _misc
    <1628>   DW_AT_decl_file   : 5
    <1629>   DW_AT_decl_line   : 415
    <162b>   DW_AT_type        : <0x19ff>
    <162f>   DW_AT_data_member_location: 116
 <2><1630>: Abbrev Number: 19 (DW_TAG_member)
    <1631>   DW_AT_name        : (indirect string, offset: 0x515): _signal_buf
    <1635>   DW_AT_decl_file   : 5
    <1636>   DW_AT_decl_line   : 416
    <1638>   DW_AT_type        : <0x1791>
    <163c>   DW_AT_data_member_location: 118
 <2><163d>: Abbrev Number: 0
 <1><163e>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <163f>   DW_AT_byte_size   : 2
    <1640>   DW_AT_type        : <0x14f8>
 <1><1644>: Abbrev Number: 17 (DW_TAG_const_type)
    <1645>   DW_AT_type        : <0x163e>
 <1><1649>: Abbrev Number: 13 (DW_TAG_structure_type)
    <164a>   DW_AT_name        : (indirect string, offset: 0x9ae): __sFILE
    <164e>   DW_AT_byte_size   : 60
    <164f>   DW_AT_decl_file   : 5
    <1650>   DW_AT_decl_line   : 179
    <1651>   DW_AT_sibling     : <0x1773>
 <2><1655>: Abbrev Number: 14 (DW_TAG_member)
    <1656>   DW_AT_name        : _p
    <1659>   DW_AT_decl_file   : 5
    <165a>   DW_AT_decl_line   : 180
    <165b>   DW_AT_type        : <0x1483>
    <165f>   DW_AT_data_member_location: 0
 <2><1660>: Abbrev Number: 14 (DW_TAG_member)
    <1661>   DW_AT_name        : _r
    <1664>   DW_AT_decl_file   : 5
    <1665>   DW_AT_decl_line   : 181
    <1666>   DW_AT_type        : <0x11d7>
    <166a>   DW_AT_data_member_location: 2
 <2><166b>: Abbrev Number: 14 (DW_TAG_member)
    <166c>   DW_AT_name        : _w
    <166f>   DW_AT_decl_file   : 5
    <1670>   DW_AT_decl_line   : 182
    <1671>   DW_AT_type        : <0x11d7>
    <1675>   DW_AT_data_member_location: 4
 <2><1676>: Abbrev Number: 11 (DW_TAG_member)
    <1677>   DW_AT_name        : (indirect string, offset: 0x532): _flags
    <167b>   DW_AT_decl_file   : 5
    <167c>   DW_AT_decl_line   : 183
    <167d>   DW_AT_type        : <0x1213>
    <1681>   DW_AT_data_member_location: 6
 <2><1682>: Abbrev Number: 11 (DW_TAG_member)
    <1683>   DW_AT_name        : (indirect string, offset: 0x772): _file
    <1687>   DW_AT_decl_file   : 5
    <1688>   DW_AT_decl_line   : 184
    <1689>   DW_AT_type        : <0x1213>
    <168d>   DW_AT_data_member_location: 8
 <2><168e>: Abbrev Number: 14 (DW_TAG_member)
    <168f>   DW_AT_name        : _bf
    <1693>   DW_AT_decl_file   : 5
    <1694>   DW_AT_decl_line   : 185
    <1695>   DW_AT_type        : <0x145e>
    <1699>   DW_AT_data_member_location: 10
 <2><169a>: Abbrev Number: 11 (DW_TAG_member)
    <169b>   DW_AT_name        : (indirect string, offset: 0x4c9): _lbfsize
    <169f>   DW_AT_decl_file   : 5
    <16a0>   DW_AT_decl_line   : 186
    <16a1>   DW_AT_type        : <0x11d7>
    <16a5>   DW_AT_data_member_location: 14
 <2><16a6>: Abbrev Number: 11 (DW_TAG_member)
    <16a7>   DW_AT_name        : (indirect string, offset: 0x6be): _data
    <16ab>   DW_AT_decl_file   : 5
    <16ac>   DW_AT_decl_line   : 189
    <16ad>   DW_AT_type        : <0x163e>
    <16b1>   DW_AT_data_member_location: 16
 <2><16b2>: Abbrev Number: 11 (DW_TAG_member)
    <16b3>   DW_AT_name        : (indirect string, offset: 0x764): _cookie
    <16b7>   DW_AT_decl_file   : 5
    <16b8>   DW_AT_decl_line   : 193
    <16b9>   DW_AT_type        : <0x12c2>
    <16bd>   DW_AT_data_member_location: 18
 <2><16be>: Abbrev Number: 11 (DW_TAG_member)
    <16bf>   DW_AT_name        : (indirect string, offset: 0x71c): _read
    <16c3>   DW_AT_decl_file   : 5
    <16c4>   DW_AT_decl_line   : 195
    <16c5>   DW_AT_type        : <0x17a3>
    <16c9>   DW_AT_data_member_location: 20
 <2><16ca>: Abbrev Number: 11 (DW_TAG_member)
    <16cb>   DW_AT_name        : (indirect string, offset: 0x539): _write
    <16cf>   DW_AT_decl_file   : 5
    <16d0>   DW_AT_decl_line   : 197
    <16d1>   DW_AT_type        : <0x17cd>
    <16d5>   DW_AT_data_member_location: 22
 <2><16d6>: Abbrev Number: 11 (DW_TAG_member)
    <16d7>   DW_AT_name        : (indirect string, offset: 0x8b9): _seek
    <16db>   DW_AT_decl_file   : 5
    <16dc>   DW_AT_decl_line   : 200
    <16dd>   DW_AT_type        : <0x17f1>
    <16e1>   DW_AT_data_member_location: 24
 <2><16e2>: Abbrev Number: 11 (DW_TAG_member)
    <16e3>   DW_AT_name        : (indirect string, offset: 0x6d5): _close
    <16e7>   DW_AT_decl_file   : 5
    <16e8>   DW_AT_decl_line   : 201
    <16e9>   DW_AT_type        : <0x180b>
    <16ed>   DW_AT_data_member_location: 26
 <2><16ee>: Abbrev Number: 14 (DW_TAG_member)
    <16ef>   DW_AT_name        : _ub
    <16f3>   DW_AT_decl_file   : 5
    <16f4>   DW_AT_decl_line   : 204
    <16f5>   DW_AT_type        : <0x145e>
    <16f9>   DW_AT_data_member_location: 28
 <2><16fa>: Abbrev Number: 14 (DW_TAG_member)
    <16fb>   DW_AT_name        : _up
    <16ff>   DW_AT_decl_file   : 5
    <1700>   DW_AT_decl_line   : 205
    <1701>   DW_AT_type        : <0x1483>
    <1705>   DW_AT_data_member_location: 32
 <2><1706>: Abbrev Number: 14 (DW_TAG_member)
    <1707>   DW_AT_name        : _ur
    <170b>   DW_AT_decl_file   : 5
    <170c>   DW_AT_decl_line   : 206
    <170d>   DW_AT_type        : <0x11d7>
    <1711>   DW_AT_data_member_location: 34
 <2><1712>: Abbrev Number: 11 (DW_TAG_member)
    <1713>   DW_AT_name        : (indirect string, offset: 0x6e5): _ubuf
    <1717>   DW_AT_decl_file   : 5
    <1718>   DW_AT_decl_line   : 209
    <1719>   DW_AT_type        : <0x1811>
    <171d>   DW_AT_data_member_location: 36
 <2><171e>: Abbrev Number: 11 (DW_TAG_member)
    <171f>   DW_AT_name        : (indirect string, offset: 0x5e9): _nbuf
    <1723>   DW_AT_decl_file   : 5
    <1724>   DW_AT_decl_line   : 210
    <1725>   DW_AT_type        : <0x1821>
    <1729>   DW_AT_data_member_location: 39
 <2><172a>: Abbrev Number: 14 (DW_TAG_member)
    <172b>   DW_AT_name        : _lb
    <172f>   DW_AT_decl_file   : 5
    <1730>   DW_AT_decl_line   : 213
    <1731>   DW_AT_type        : <0x145e>
    <1735>   DW_AT_data_member_location: 40
 <2><1736>: Abbrev Number: 11 (DW_TAG_member)
    <1737>   DW_AT_name        : (indirect string, offset: 0x917): _blksize
    <173b>   DW_AT_decl_file   : 5
    <173c>   DW_AT_decl_line   : 216
    <173d>   DW_AT_type        : <0x11d7>
    <1741>   DW_AT_data_member_location: 44
 <2><1742>: Abbrev Number: 11 (DW_TAG_member)
    <1743>   DW_AT_name        : (indirect string, offset: 0x508): _offset
    <1747>   DW_AT_decl_file   : 5
    <1748>   DW_AT_decl_line   : 217
    <1749>   DW_AT_type        : <0x123a>
    <174d>   DW_AT_data_member_location: 46
 <2><174e>: Abbrev Number: 11 (DW_TAG_member)
    <174f>   DW_AT_name        : (indirect string, offset: 0x688): _lock
    <1753>   DW_AT_decl_file   : 5
    <1754>   DW_AT_decl_line   : 224
    <1755>   DW_AT_type        : <0x12b7>
    <1759>   DW_AT_data_member_location: 50
 <2><175a>: Abbrev Number: 11 (DW_TAG_member)
    <175b>   DW_AT_name        : (indirect string, offset: 0x660): _mbstate
    <175f>   DW_AT_decl_file   : 5
    <1760>   DW_AT_decl_line   : 226
    <1761>   DW_AT_type        : <0x12ac>
    <1765>   DW_AT_data_member_location: 52
 <2><1766>: Abbrev Number: 11 (DW_TAG_member)
    <1767>   DW_AT_name        : (indirect string, offset: 0x496): _flags2
    <176b>   DW_AT_decl_file   : 5
    <176c>   DW_AT_decl_line   : 227
    <176d>   DW_AT_type        : <0x11d7>
    <1771>   DW_AT_data_member_location: 58
 <2><1772>: Abbrev Number: 0
 <1><1773>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <1774>   DW_AT_prototyped  : 1
    <1774>   DW_AT_type        : <0x11d7>
    <1778>   DW_AT_sibling     : <0x1791>
 <2><177c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <177d>   DW_AT_type        : <0x163e>
 <2><1781>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1782>   DW_AT_type        : <0x12c2>
 <2><1786>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1787>   DW_AT_type        : <0x1791>
 <2><178b>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <178c>   DW_AT_type        : <0x11d7>
 <2><1790>: Abbrev Number: 0
 <1><1791>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1792>   DW_AT_byte_size   : 2
    <1793>   DW_AT_type        : <0x1797>
 <1><1797>: Abbrev Number: 4 (DW_TAG_base_type)
    <1798>   DW_AT_byte_size   : 1
    <1799>   DW_AT_encoding    : 8	(unsigned char)
    <179a>   DW_AT_name        : (indirect string, offset: 0x293): char
 <1><179e>: Abbrev Number: 17 (DW_TAG_const_type)
    <179f>   DW_AT_type        : <0x1797>
 <1><17a3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <17a4>   DW_AT_byte_size   : 2
    <17a5>   DW_AT_type        : <0x1773>
 <1><17a9>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <17aa>   DW_AT_prototyped  : 1
    <17aa>   DW_AT_type        : <0x11d7>
    <17ae>   DW_AT_sibling     : <0x17c7>
 <2><17b2>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <17b3>   DW_AT_type        : <0x163e>
 <2><17b7>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <17b8>   DW_AT_type        : <0x12c2>
 <2><17bc>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <17bd>   DW_AT_type        : <0x17c7>
 <2><17c1>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <17c2>   DW_AT_type        : <0x11d7>
 <2><17c6>: Abbrev Number: 0
 <1><17c7>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <17c8>   DW_AT_byte_size   : 2
    <17c9>   DW_AT_type        : <0x179e>
 <1><17cd>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <17ce>   DW_AT_byte_size   : 2
    <17cf>   DW_AT_type        : <0x17a9>
 <1><17d3>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <17d4>   DW_AT_prototyped  : 1
    <17d4>   DW_AT_type        : <0x1245>
    <17d8>   DW_AT_sibling     : <0x17f1>
 <2><17dc>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <17dd>   DW_AT_type        : <0x163e>
 <2><17e1>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <17e2>   DW_AT_type        : <0x12c2>
 <2><17e6>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <17e7>   DW_AT_type        : <0x1245>
 <2><17eb>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <17ec>   DW_AT_type        : <0x11d7>
 <2><17f0>: Abbrev Number: 0
 <1><17f1>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <17f2>   DW_AT_byte_size   : 2
    <17f3>   DW_AT_type        : <0x17d3>
 <1><17f7>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <17f8>   DW_AT_prototyped  : 1
    <17f8>   DW_AT_type        : <0x11d7>
    <17fc>   DW_AT_sibling     : <0x180b>
 <2><1800>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1801>   DW_AT_type        : <0x163e>
 <2><1805>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1806>   DW_AT_type        : <0x12c2>
 <2><180a>: Abbrev Number: 0
 <1><180b>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <180c>   DW_AT_byte_size   : 2
    <180d>   DW_AT_type        : <0x17f7>
 <1><1811>: Abbrev Number: 8 (DW_TAG_array_type)
    <1812>   DW_AT_type        : <0x120c>
    <1816>   DW_AT_sibling     : <0x1821>
 <2><181a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <181b>   DW_AT_type        : <0x11e9>
    <181f>   DW_AT_upper_bound : 2
 <2><1820>: Abbrev Number: 0
 <1><1821>: Abbrev Number: 8 (DW_TAG_array_type)
    <1822>   DW_AT_type        : <0x120c>
    <1826>   DW_AT_sibling     : <0x1831>
 <2><182a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <182b>   DW_AT_type        : <0x11e9>
    <182f>   DW_AT_upper_bound : 0
 <2><1830>: Abbrev Number: 0
 <1><1831>: Abbrev Number: 5 (DW_TAG_typedef)
    <1832>   DW_AT_name        : (indirect string, offset: 0x60a): __FILE
    <1836>   DW_AT_decl_file   : 5
    <1837>   DW_AT_decl_line   : 285
    <1839>   DW_AT_type        : <0x1649>
 <1><183d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <183e>   DW_AT_name        : (indirect string, offset: 0x787): _glue
    <1842>   DW_AT_byte_size   : 6
    <1843>   DW_AT_decl_file   : 5
    <1844>   DW_AT_decl_line   : 289
    <1846>   DW_AT_sibling     : <0x1872>
 <2><184a>: Abbrev Number: 19 (DW_TAG_member)
    <184b>   DW_AT_name        : (indirect string, offset: 0x7e3): _next
    <184f>   DW_AT_decl_file   : 5
    <1850>   DW_AT_decl_line   : 291
    <1852>   DW_AT_type        : <0x1872>
    <1856>   DW_AT_data_member_location: 0
 <2><1857>: Abbrev Number: 19 (DW_TAG_member)
    <1858>   DW_AT_name        : (indirect string, offset: 0x49e): _niobs
    <185c>   DW_AT_decl_file   : 5
    <185d>   DW_AT_decl_line   : 292
    <185f>   DW_AT_type        : <0x11d7>
    <1863>   DW_AT_data_member_location: 2
 <2><1864>: Abbrev Number: 19 (DW_TAG_member)
    <1865>   DW_AT_name        : (indirect string, offset: 0x490): _iobs
    <1869>   DW_AT_decl_file   : 5
    <186a>   DW_AT_decl_line   : 293
    <186c>   DW_AT_type        : <0x1878>
    <1870>   DW_AT_data_member_location: 4
 <2><1871>: Abbrev Number: 0
 <1><1872>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1873>   DW_AT_byte_size   : 2
    <1874>   DW_AT_type        : <0x183d>
 <1><1878>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1879>   DW_AT_byte_size   : 2
    <187a>   DW_AT_type        : <0x1831>
 <1><187e>: Abbrev Number: 18 (DW_TAG_structure_type)
    <187f>   DW_AT_name        : (indirect string, offset: 0x89f): _rand48
    <1883>   DW_AT_byte_size   : 22
    <1884>   DW_AT_decl_file   : 5
    <1885>   DW_AT_decl_line   : 317
    <1887>   DW_AT_sibling     : <0x18c0>
 <2><188b>: Abbrev Number: 19 (DW_TAG_member)
    <188c>   DW_AT_name        : (indirect string, offset: 0x899): _seed
    <1890>   DW_AT_decl_file   : 5
    <1891>   DW_AT_decl_line   : 318
    <1893>   DW_AT_type        : <0x18c0>
    <1897>   DW_AT_data_member_location: 0
 <2><1898>: Abbrev Number: 19 (DW_TAG_member)
    <1899>   DW_AT_name        : (indirect string, offset: 0x68e): _mult
    <189d>   DW_AT_decl_file   : 5
    <189e>   DW_AT_decl_line   : 319
    <18a0>   DW_AT_type        : <0x18c0>
    <18a4>   DW_AT_data_member_location: 6
 <2><18a5>: Abbrev Number: 19 (DW_TAG_member)
    <18a6>   DW_AT_name        : (indirect string, offset: 0x4e8): _add
    <18aa>   DW_AT_decl_file   : 5
    <18ab>   DW_AT_decl_line   : 320
    <18ad>   DW_AT_type        : <0x121a>
    <18b1>   DW_AT_data_member_location: 12
 <2><18b2>: Abbrev Number: 19 (DW_TAG_member)
    <18b3>   DW_AT_name        : (indirect string, offset: 0x7de): _rand_next
    <18b7>   DW_AT_decl_file   : 5
    <18b8>   DW_AT_decl_line   : 323
    <18ba>   DW_AT_type        : <0x1228>
    <18be>   DW_AT_data_member_location: 14
 <2><18bf>: Abbrev Number: 0
 <1><18c0>: Abbrev Number: 8 (DW_TAG_array_type)
    <18c1>   DW_AT_type        : <0x121a>
    <18c5>   DW_AT_sibling     : <0x18d0>
 <2><18c9>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <18ca>   DW_AT_type        : <0x11e9>
    <18ce>   DW_AT_upper_bound : 2
 <2><18cf>: Abbrev Number: 0
 <1><18d0>: Abbrev Number: 18 (DW_TAG_structure_type)
    <18d1>   DW_AT_name        : (indirect string, offset: 0x792): _mprec
    <18d5>   DW_AT_byte_size   : 8
    <18d6>   DW_AT_decl_file   : 5
    <18d7>   DW_AT_decl_line   : 342
    <18d9>   DW_AT_sibling     : <0x1912>
 <2><18dd>: Abbrev Number: 19 (DW_TAG_member)
    <18de>   DW_AT_name        : (indirect string, offset: 0x8d0): _result
    <18e2>   DW_AT_decl_file   : 5
    <18e3>   DW_AT_decl_line   : 345
    <18e5>   DW_AT_type        : <0x1322>
    <18e9>   DW_AT_data_member_location: 0
 <2><18ea>: Abbrev Number: 19 (DW_TAG_member)
    <18eb>   DW_AT_name        : (indirect string, offset: 0x4ed): _result_k
    <18ef>   DW_AT_decl_file   : 5
    <18f0>   DW_AT_decl_line   : 346
    <18f2>   DW_AT_type        : <0x11d7>
    <18f6>   DW_AT_data_member_location: 2
 <2><18f7>: Abbrev Number: 19 (DW_TAG_member)
    <18f8>   DW_AT_name        : (indirect string, offset: 0x955): _p5s
    <18fc>   DW_AT_decl_file   : 5
    <18fd>   DW_AT_decl_line   : 347
    <18ff>   DW_AT_type        : <0x1322>
    <1903>   DW_AT_data_member_location: 4
 <2><1904>: Abbrev Number: 19 (DW_TAG_member)
    <1905>   DW_AT_name        : (indirect string, offset: 0x638): _freelist
    <1909>   DW_AT_decl_file   : 5
    <190a>   DW_AT_decl_line   : 348
    <190c>   DW_AT_type        : <0x1912>
    <1910>   DW_AT_data_member_location: 6
 <2><1911>: Abbrev Number: 0
 <1><1912>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1913>   DW_AT_byte_size   : 2
    <1914>   DW_AT_type        : <0x1322>
 <1><1918>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1919>   DW_AT_name        : (indirect string, offset: 0x972): _misc_reent
    <191d>   DW_AT_byte_size   : 60
    <191e>   DW_AT_decl_file   : 5
    <191f>   DW_AT_decl_line   : 352
    <1921>   DW_AT_sibling     : <0x19b5>
 <2><1925>: Abbrev Number: 19 (DW_TAG_member)
    <1926>   DW_AT_name        : (indirect string, offset: 0x88c): _strtok_last
    <192a>   DW_AT_decl_file   : 5
    <192b>   DW_AT_decl_line   : 355
    <192d>   DW_AT_type        : <0x1791>
    <1931>   DW_AT_data_member_location: 0
 <2><1932>: Abbrev Number: 19 (DW_TAG_member)
    <1933>   DW_AT_name        : (indirect string, offset: 0x4a5): _mblen_state
    <1937>   DW_AT_decl_file   : 5
    <1938>   DW_AT_decl_line   : 356
    <193a>   DW_AT_type        : <0x12ac>
    <193e>   DW_AT_data_member_location: 2
 <2><193f>: Abbrev Number: 19 (DW_TAG_member)
    <1940>   DW_AT_name        : (indirect string, offset: 0x932): _wctomb_state
    <1944>   DW_AT_decl_file   : 5
    <1945>   DW_AT_decl_line   : 357
    <1947>   DW_AT_type        : <0x12ac>
    <194b>   DW_AT_data_member_location: 8
 <2><194c>: Abbrev Number: 19 (DW_TAG_member)
    <194d>   DW_AT_name        : (indirect string, offset: 0x79e): _mbtowc_state
    <1951>   DW_AT_decl_file   : 5
    <1952>   DW_AT_decl_line   : 358
    <1954>   DW_AT_type        : <0x12ac>
    <1958>   DW_AT_data_member_location: 14
 <2><1959>: Abbrev Number: 19 (DW_TAG_member)
    <195a>   DW_AT_name        : (indirect string, offset: 0x4b2): _l64a_buf
    <195e>   DW_AT_decl_file   : 5
    <195f>   DW_AT_decl_line   : 359
    <1961>   DW_AT_type        : <0x19b5>
    <1965>   DW_AT_data_member_location: 20
 <2><1966>: Abbrev Number: 19 (DW_TAG_member)
    <1967>   DW_AT_name        : (indirect string, offset: 0x618): _getdate_err
    <196b>   DW_AT_decl_file   : 5
    <196c>   DW_AT_decl_line   : 360
    <196e>   DW_AT_type        : <0x11d7>
    <1972>   DW_AT_data_member_location: 28
 <2><1973>: Abbrev Number: 19 (DW_TAG_member)
    <1974>   DW_AT_name        : (indirect string, offset: 0x7b3): _mbrlen_state
    <1978>   DW_AT_decl_file   : 5
    <1979>   DW_AT_decl_line   : 361
    <197b>   DW_AT_type        : <0x12ac>
    <197f>   DW_AT_data_member_location: 30
 <2><1980>: Abbrev Number: 19 (DW_TAG_member)
    <1981>   DW_AT_name        : (indirect string, offset: 0x744): _mbrtowc_state
    <1985>   DW_AT_decl_file   : 5
    <1986>   DW_AT_decl_line   : 362
    <1988>   DW_AT_type        : <0x12ac>
    <198c>   DW_AT_data_member_location: 36
 <2><198d>: Abbrev Number: 19 (DW_TAG_member)
    <198e>   DW_AT_name        : (indirect string, offset: 0x5c3): _mbsrtowcs_state
    <1992>   DW_AT_decl_file   : 5
    <1993>   DW_AT_decl_line   : 363
    <1995>   DW_AT_type        : <0x12ac>
    <1999>   DW_AT_data_member_location: 42
 <2><199a>: Abbrev Number: 19 (DW_TAG_member)
    <199b>   DW_AT_name        : (indirect string, offset: 0x98e): _wcrtomb_state
    <199f>   DW_AT_decl_file   : 5
    <19a0>   DW_AT_decl_line   : 364
    <19a2>   DW_AT_type        : <0x12ac>
    <19a6>   DW_AT_data_member_location: 48
 <2><19a7>: Abbrev Number: 19 (DW_TAG_member)
    <19a8>   DW_AT_name        : (indirect string, offset: 0x521): _wcsrtombs_state
    <19ac>   DW_AT_decl_file   : 5
    <19ad>   DW_AT_decl_line   : 365
    <19af>   DW_AT_type        : <0x12ac>
    <19b3>   DW_AT_data_member_location: 54
 <2><19b4>: Abbrev Number: 0
 <1><19b5>: Abbrev Number: 8 (DW_TAG_array_type)
    <19b6>   DW_AT_type        : <0x1797>
    <19ba>   DW_AT_sibling     : <0x19c5>
 <2><19be>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <19bf>   DW_AT_type        : <0x11e9>
    <19c3>   DW_AT_upper_bound : 7
 <2><19c4>: Abbrev Number: 0
 <1><19c5>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <19c6>   DW_AT_byte_size   : 2
    <19c7>   DW_AT_type        : <0x18d0>
 <1><19cb>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <19cc>   DW_AT_prototyped  : 1
    <19cc>   DW_AT_sibling     : <0x19d6>
 <2><19d0>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <19d1>   DW_AT_type        : <0x163e>
 <2><19d5>: Abbrev Number: 0
 <1><19d6>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <19d7>   DW_AT_byte_size   : 2
    <19d8>   DW_AT_type        : <0x19cb>
 <1><19dc>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <19dd>   DW_AT_byte_size   : 2
    <19de>   DW_AT_type        : <0x187e>
 <1><19e2>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <19e3>   DW_AT_byte_size   : 2
    <19e4>   DW_AT_type        : <0x1338>
 <1><19e8>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <19e9>   DW_AT_prototyped  : 1
    <19e9>   DW_AT_sibling     : <0x19f3>
 <2><19ed>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <19ee>   DW_AT_type        : <0x11d7>
 <2><19f2>: Abbrev Number: 0
 <1><19f3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <19f4>   DW_AT_byte_size   : 2
    <19f5>   DW_AT_type        : <0x19f9>
 <1><19f9>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <19fa>   DW_AT_byte_size   : 2
    <19fb>   DW_AT_type        : <0x19e8>
 <1><19ff>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1a00>   DW_AT_byte_size   : 2
    <1a01>   DW_AT_type        : <0x1918>
 <1><1a05>: Abbrev Number: 24 (DW_TAG_variable)
    <1a06>   DW_AT_name        : (indirect string, offset: 0x69f): __sf_fake_stdin
    <1a0a>   DW_AT_decl_file   : 5
    <1a0b>   DW_AT_decl_line   : 419
    <1a0d>   DW_AT_type        : <0x14f3>
    <1a11>   DW_AT_external    : 1
    <1a11>   DW_AT_declaration : 1
 <1><1a11>: Abbrev Number: 24 (DW_TAG_variable)
    <1a12>   DW_AT_name        : (indirect string, offset: 0x8bf): __sf_fake_stdout
    <1a16>   DW_AT_decl_file   : 5
    <1a17>   DW_AT_decl_line   : 420
    <1a19>   DW_AT_type        : <0x14f3>
    <1a1d>   DW_AT_external    : 1
    <1a1d>   DW_AT_declaration : 1
 <1><1a1d>: Abbrev Number: 24 (DW_TAG_variable)
    <1a1e>   DW_AT_name        : (indirect string, offset: 0x4f7): __sf_fake_stderr
    <1a22>   DW_AT_decl_file   : 5
    <1a23>   DW_AT_decl_line   : 421
    <1a25>   DW_AT_type        : <0x14f3>
    <1a29>   DW_AT_external    : 1
    <1a29>   DW_AT_declaration : 1
 <1><1a29>: Abbrev Number: 24 (DW_TAG_variable)
    <1a2a>   DW_AT_name        : (indirect string, offset: 0x6f2): _impure_ptr
    <1a2e>   DW_AT_decl_file   : 5
    <1a2f>   DW_AT_decl_line   : 765
